{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/ainestorov/Documents/ECON 613/613 PS5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Apr 2019, 21:17:12
{txt}
{com}. 
. * Alex Nestorov
. * ECON 613
. * Assignment #5
. 
. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. set scrollbufsize 2000000
{txt}({cmd:set scrollbufsize} will take effect the next time you launch Stata)

{com}. cd "/Users/ainestorov/Documents/ECON 613"
{res}/Users/ainestorov/Documents/ECON 613
{txt}
{com}. pwd
{res}/Users/ainestorov/Documents/ECON 613
{txt}
{com}. ssc install estout
{txt}checking {hilite:estout} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. ******************************************
. ************* PROBLEM SET 2 **************
. ******************************************
. 
. ************* Exercise 1: Data Creation **************
. set seed 15
{txt}
{com}. set obs 10000
{txt}{p}
number of observations (_N)  was 0,
now 10,000
{p_end}

{com}. gen X1 = runiform(1, 3)
{txt}
{com}. gen X2 = rgamma(3, 2)
{txt}
{com}. gen X3 = rbinomial(1, 0.3)
{txt}
{com}. gen eps = rnormal(2, 1)
{txt}
{com}. gen Y = 0.5 + 1.2*X1 + (-0.9)*X2 + 0.1*X3 + eps
{txt}
{com}. egen Y_mean = mean(Y)
{txt}
{com}. gen ydum = 0
{txt}
{com}. replace ydum = 1 if Y>Y_mean
{txt}(5,579 real changes made)

{com}. global xvars "X1 X2 X3"
{txt}
{com}. 
. ************* Exercise 2: OLS **************
. * correlation b/n Y and X1
. cor Y X1
{txt}(obs=10,000)

             {c |}        Y       X1
{hline 13}{c +}{hline 18}
           Y {c |}{res}   1.0000
          {txt}X1 {c |}{res}   0.1985   1.0000

{txt}
{com}. 
. * regress Y on X
. reg Y $xvars

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,000
{txt}{hline 13}{c +}{hline 34}   F(3, 9996)      = {res} 32830.25
{txt}       Model {c |} {res} 101494.928         3  33831.6428   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 10300.8985     9,996  1.03050205   {txt}R-squared       ={res}    0.9079
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9078
{txt}       Total {c |} {res} 111795.827     9,999  11.1807008   {txt}Root MSE        =   {res} 1.0151

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.193422{col 26}{space 2}  .017634{col 37}{space 1}   67.68{col 46}{space 3}0.000{col 54}{space 4} 1.158856{col 67}{space 3} 1.227988
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.8974038{col 26}{space 2} .0029242{col 37}{space 1} -306.89{col 46}{space 3}0.000{col 54}{space 4}-.9031358{col 67}{space 3}-.8916718
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1132924{col 26}{space 2} .0223412{col 37}{space 1}    5.07{col 46}{space 3}0.000{col 54}{space 4} .0694992{col 67}{space 3} .1570856
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.498497{col 26}{space 2} .0408538{col 37}{space 1}   61.16{col 46}{space 3}0.000{col 54}{space 4} 2.418415{col 67}{space 3} 2.578579
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo PS2_OLS1
{txt}
{com}. 
. * calculate standard errors using bootstrap
. bootstrap, reps(49): reg Y $xvars
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}49{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}Replications{col 67}= {res}        49
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res} 109203.42
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9079
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9078
{txt}{col 49}Root MSE{col 67}= {res}    1.0151

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.193422{col 26}{space 2} .0144922{col 37}{space 1}   82.35{col 46}{space 3}0.000{col 54}{space 4} 1.165018{col 67}{space 3} 1.221826
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.8974038{col 26}{space 2} .0029691{col 37}{space 1} -302.25{col 46}{space 3}0.000{col 54}{space 4} -.903223{col 67}{space 3}-.8915845
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1132924{col 26}{space 2} .0208389{col 37}{space 1}    5.44{col 46}{space 3}0.000{col 54}{space 4}  .072449{col 67}{space 3} .1541358
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.498497{col 26}{space 2} .0390213{col 37}{space 1}   64.03{col 46}{space 3}0.000{col 54}{space 4} 2.422017{col 67}{space 3} 2.574977
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo PS2_OLS2
{txt}
{com}. 
. bootstrap, reps(499): reg Y $xvars
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}499{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}Replications{col 67}= {res}       499
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res} 104932.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9079
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9078
{txt}{col 49}Root MSE{col 67}= {res}    1.0151

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.193422{col 26}{space 2} .0183092{col 37}{space 1}   65.18{col 46}{space 3}0.000{col 54}{space 4} 1.157537{col 67}{space 3} 1.229308
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.8974038{col 26}{space 2} .0028228{col 37}{space 1} -317.91{col 46}{space 3}0.000{col 54}{space 4}-.9029364{col 67}{space 3}-.8918711
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1132924{col 26}{space 2} .0212932{col 37}{space 1}    5.32{col 46}{space 3}0.000{col 54}{space 4} .0715586{col 67}{space 3} .1550262
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.498497{col 26}{space 2} .0413718{col 37}{space 1}   60.39{col 46}{space 3}0.000{col 54}{space 4}  2.41741{col 67}{space 3} 2.579584
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo PS2_OLS3
{txt}
{com}. 
. * table of results
. esttab PS2_OLS1 PS2_OLS2 PS2_OLS3, se(3) nonumbers title(OLS Regressions) ///
> mtitles("Normal OLS" "Bootstrap 49" "Bootstrap 499")
{res}
{txt}OLS Regressions
{txt}{hline 60}
{txt}               Normal OLS    Bootstrap 49    Bootstra~499   
{txt}{hline 60}
{txt}X1          {res}        1.193***        1.193***        1.193***{txt}
            {res} {ralign 12:{txt:(}0.018{txt:)}}    {ralign 12:{txt:(}0.014{txt:)}}    {ralign 12:{txt:(}0.018{txt:)}}   {txt}

{txt}X2          {res}       -0.897***       -0.897***       -0.897***{txt}
            {res} {ralign 12:{txt:(}0.003{txt:)}}    {ralign 12:{txt:(}0.003{txt:)}}    {ralign 12:{txt:(}0.003{txt:)}}   {txt}

{txt}X3          {res}        0.113***        0.113***        0.113***{txt}
            {res} {ralign 12:{txt:(}0.022{txt:)}}    {ralign 12:{txt:(}0.021{txt:)}}    {ralign 12:{txt:(}0.021{txt:)}}   {txt}

{txt}_cons       {res}        2.498***        2.498***        2.498***{txt}
            {res} {ralign 12:{txt:(}0.041{txt:)}}    {ralign 12:{txt:(}0.039{txt:)}}    {ralign 12:{txt:(}0.041{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}        10000           10000           10000   {txt}
{txt}{hline 60}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. 
. ************* Exercise 3: Numerical Optimization **************
. probit ydum $xvars

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6864.2729}  
Iteration 1:{space 3}log likelihood = {res:-2271.1847}  
Iteration 2:{space 3}log likelihood = {res:-2151.0733}  
Iteration 3:{space 3}log likelihood = {res:-2149.3954}  
Iteration 4:{space 3}log likelihood = {res:-2149.3925}  
Iteration 5:{space 3}log likelihood = {res:-2149.3925}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   9429.76
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2149.3925{txt}{col 49}Pseudo R2{col 67}= {res}    0.6869

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.208109{col 26}{space 2} .0442265{col 37}{space 1}   27.32{col 46}{space 3}0.000{col 54}{space 4} 1.121427{col 67}{space 3} 1.294792
{txt}{space 10}X2 {c |}{col 14}{res}{space 2} -.908844{col 26}{space 2} .0187042{col 37}{space 1}  -48.59{col 46}{space 3}0.000{col 54}{space 4}-.9455036{col 67}{space 3}-.8721844
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1130533{col 26}{space 2} .0480223{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0189313{col 67}{space 3} .2071753
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.933585{col 26}{space 2} .0987752{col 37}{space 1}   29.70{col 46}{space 3}0.000{col 54}{space 4} 2.739989{col 67}{space 3} 3.127181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 533 failures and 4 successes completely determined.{p_end}

{com}. eststo PS2_Probit
{txt}
{com}. 
. ************* Exercise 4: Discrete Choice **************
. * logit regression
. logit ydum $xvars

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6864.2729}  
Iteration 1:{space 3}log likelihood = {res:-2257.5829}  
Iteration 2:{space 3}log likelihood = {res:-2188.9407}  
Iteration 3:{space 3}log likelihood = {res:-2156.3997}  
Iteration 4:{space 3}log likelihood = {res: -2156.111}  
Iteration 5:{space 3}log likelihood = {res:-2156.1108}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   9416.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2156.1108{txt}{col 49}Pseudo R2{col 67}= {res}    0.6859

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 2.163695{col 26}{space 2}  .081954{col 37}{space 1}   26.40{col 46}{space 3}0.000{col 54}{space 4} 2.003069{col 67}{space 3} 2.324322
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.633734{col 26}{space 2} .0373407{col 37}{space 1}  -43.75{col 46}{space 3}0.000{col 54}{space 4} -1.70692{col 67}{space 3}-1.560547
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .2055849{col 26}{space 2} .0860388{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} .0369518{col 67}{space 3} .3742179
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.287589{col 26}{space 2} .1860889{col 37}{space 1}   28.41{col 46}{space 3}0.000{col 54}{space 4} 4.922861{col 67}{space 3} 5.652316
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 92 failures and 0 successes completely determined.{p_end}

{com}. eststo PS2_Logit
{txt}
{com}. 
. * OLS regression
. reg ydum $xvars

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,000
{txt}{hline 13}{c +}{hline 34}   F(3, 9996)      = {res}  4196.93
{txt}       Model {c |} {res} 1374.91302         3   458.30434   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1091.56288     9,996  .109199968   {txt}R-squared       ={res}    0.5574
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5573
{txt}       Total {c |} {res}  2466.4759     9,999  .246672257   {txt}Root MSE        =   {res} .33045

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .1535089{col 26}{space 2} .0057403{col 37}{space 1}   26.74{col 46}{space 3}0.000{col 54}{space 4} .1422567{col 67}{space 3} .1647611
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1038842{col 26}{space 2} .0009519{col 37}{space 1} -109.13{col 46}{space 3}0.000{col 54}{space 4}-.1057501{col 67}{space 3}-.1020183
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0182543{col 26}{space 2} .0072727{col 37}{space 1}    2.51{col 46}{space 3}0.012{col 54}{space 4} .0039985{col 67}{space 3} .0325102
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8665227{col 26}{space 2}  .013299{col 37}{space 1}   65.16{col 46}{space 3}0.000{col 54}{space 4}  .840454{col 67}{space 3} .8925914
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo PS2_LP
{txt}
{com}. 
. * table of results from Exercises 3&4
. esttab PS2_Probit PS2_Logit PS2_LP, se(3) title(Discrete Choice Regressions) ///
> nonumbers mtitles("Probit" "Logit" "Linear Prob")
{res}
{txt}Discrete Choice Regressions
{txt}{hline 60}
{txt}                   Probit           Logit     Linear Prob   
{txt}{hline 60}
{res}main                                                        {txt}
{txt}X1          {res}        1.208***        2.164***        0.154***{txt}
            {res} {ralign 12:{txt:(}0.044{txt:)}}    {ralign 12:{txt:(}0.082{txt:)}}    {ralign 12:{txt:(}0.006{txt:)}}   {txt}

{txt}X2          {res}       -0.909***       -1.634***       -0.104***{txt}
            {res} {ralign 12:{txt:(}0.019{txt:)}}    {ralign 12:{txt:(}0.037{txt:)}}    {ralign 12:{txt:(}0.001{txt:)}}   {txt}

{txt}X3          {res}        0.113*          0.206*         0.0183*  {txt}
            {res} {ralign 12:{txt:(}0.048{txt:)}}    {ralign 12:{txt:(}0.086{txt:)}}    {ralign 12:{txt:(}0.007{txt:)}}   {txt}

{txt}_cons       {res}        2.934***        5.288***        0.867***{txt}
            {res} {ralign 12:{txt:(}0.099{txt:)}}    {ralign 12:{txt:(}0.186{txt:)}}    {ralign 12:{txt:(}0.013{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}        10000           10000           10000   {txt}
{txt}{hline 60}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. 
. ************* Exercise 5: Marginal Effects **************
. * marginal effects of probit
. quietly probit ydum $xvars
{txt}
{com}. margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:X1}{space 14}{txt:=} {space 3}1.993826 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:X2}{space 14}{txt:=} {space 3}5.968318 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:X3}{space 14}{txt:=} {space 6}.2915 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .4813883{col 26}{space 2} .0176232{col 37}{space 1}   27.32{col 46}{space 3}0.000{col 54}{space 4} .4468475{col 67}{space 3} .5159291
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.3621418{col 26}{space 2} .0073756{col 37}{space 1}  -49.10{col 46}{space 3}0.000{col 54}{space 4}-.3765977{col 67}{space 3}-.3476859
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0450477{col 26}{space 2} .0191356{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0075425{col 67}{space 3} .0825529
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo PS2_P_MEs 
{txt}
{com}. 
. * marginal effects of logit
. quietly logit ydum $xvars
{txt}
{com}. margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:X1}{space 14}{txt:=} {space 3}1.993826 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:X2}{space 14}{txt:=} {space 3}5.968318 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:X3}{space 14}{txt:=} {space 6}.2915 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .5398519{col 26}{space 2} .0204566{col 37}{space 1}   26.39{col 46}{space 3}0.000{col 54}{space 4} .4997577{col 67}{space 3}  .579946
{txt}{space 10}X2 {c |}{col 14}{res}{space 2} -.407624{col 26}{space 2} .0091943{col 37}{space 1}  -44.33{col 46}{space 3}0.000{col 54}{space 4}-.4256444{col 67}{space 3}-.3896036
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0512944{col 26}{space 2} .0214676{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} .0092186{col 67}{space 3} .0933701
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo PS2_L_MEs
{txt}
{com}. 
. * calculate standard errors of both probit and logit using bootstrap
. bootstrap, reps(99): probit ydum $xvars
{txt}(running probit on estimation sample)
{res}
{txt}Bootstrap replications ({res}99{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.................................................
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}Replications{col 67}= {res}        99
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}   2749.47
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2149.3925{txt}{col 49}Pseudo R2{col 67}= {res}    0.6869

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 1.208109{col 26}{space 2} .0466064{col 37}{space 1}   25.92{col 46}{space 3}0.000{col 54}{space 4} 1.116762{col 67}{space 3} 1.299456
{txt}{space 10}X2 {c |}{col 14}{res}{space 2} -.908844{col 26}{space 2} .0173652{col 37}{space 1}  -52.34{col 46}{space 3}0.000{col 54}{space 4}-.9428792{col 67}{space 3}-.8748089
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1130533{col 26}{space 2} .0490433{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} .0169301{col 67}{space 3} .2091765
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.933585{col 26}{space 2} .0973304{col 37}{space 1}   30.14{col 46}{space 3}0.000{col 54}{space 4} 2.742821{col 67}{space 3} 3.124349
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 533 failures and 4 successes completely determined.{p_end}

{com}. margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}Bootstrap

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:X1}{space 14}{txt:=} {space 3}1.993826 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:X2}{space 14}{txt:=} {space 3}5.968318 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:X3}{space 14}{txt:=} {space 6}.2915 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .4813883{col 26}{space 2} .0186318{col 37}{space 1}   25.84{col 46}{space 3}0.000{col 54}{space 4} .4448706{col 67}{space 3} .5179061
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.3621418{col 26}{space 2} .0069172{col 37}{space 1}  -52.35{col 46}{space 3}0.000{col 54}{space 4}-.3756992{col 67}{space 3}-.3485844
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0450477{col 26}{space 2} .0195474{col 37}{space 1}    2.30{col 46}{space 3}0.021{col 54}{space 4} .0067356{col 67}{space 3} .0833599
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo PS2_P_MEs_B99
{txt}
{com}. 
. bootstrap, reps(99): logit ydum $xvars
{txt}(running logit on estimation sample)
{res}
{txt}Bootstrap replications ({res}99{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.................................................
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}Replications{col 67}= {res}        99
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}   2668.01
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2156.1108{txt}{col 49}Pseudo R2{col 67}= {res}    0.6859

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} 2.163695{col 26}{space 2} .0804464{col 37}{space 1}   26.90{col 46}{space 3}0.000{col 54}{space 4} 2.006023{col 67}{space 3} 2.321368
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.633734{col 26}{space 2} .0321927{col 37}{space 1}  -50.75{col 46}{space 3}0.000{col 54}{space 4} -1.69683{col 67}{space 3}-1.570637
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .2055849{col 26}{space 2}  .087541{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0340076{col 67}{space 3} .3771621
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.287589{col 26}{space 2} .1769095{col 37}{space 1}   29.89{col 46}{space 3}0.000{col 54}{space 4} 4.940852{col 67}{space 3} 5.634325
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 92 failures and 0 successes completely determined.{p_end}

{com}. margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}Bootstrap

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:X1}{space 14}{txt:=} {space 3}1.993826 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:X2}{space 14}{txt:=} {space 3}5.968318 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:X3}{space 14}{txt:=} {space 6}.2915 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .5398519{col 26}{space 2} .0201052{col 37}{space 1}   26.85{col 46}{space 3}0.000{col 54}{space 4} .5004464{col 67}{space 3} .5792574
{txt}{space 10}X2 {c |}{col 14}{res}{space 2} -.407624{col 26}{space 2} .0080032{col 37}{space 1}  -50.93{col 46}{space 3}0.000{col 54}{space 4}-.4233099{col 67}{space 3}-.3919381
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0512944{col 26}{space 2}  .021838{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0084926{col 67}{space 3} .0940961
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo PS2_L_MEs_B99
{txt}
{com}. 
. * table of results
. esttab PS2_P_MEs PS2_P_MEs_B99 PS2_L_MEs PS2_L_MEs_B99, se(5) ///
> title(Marginal Effects) nonumbers equations(1) ///
> mtitles("Probit Delta MEs" "Probit Boot MEs" "Logit Delta MEs" "Logit Boot MEs")
{res}
{txt}Marginal Effects
{txt}{hline 76}
{txt}             Probit Del~s    Probit Boo~s    Logit Delt~s    Logit Boot~s   
{txt}{hline 76}
{res}#1                                                                          {txt}
{txt}X1          {res}        0.481***        0.481***        0.540***        0.540***{txt}
            {res} {ralign 12:{txt:(}0.01762{txt:)}}    {ralign 12:{txt:(}0.01863{txt:)}}    {ralign 12:{txt:(}0.02046{txt:)}}    {ralign 12:{txt:(}0.02011{txt:)}}   {txt}

{txt}X2          {res}       -0.362***       -0.362***       -0.408***       -0.408***{txt}
            {res} {ralign 12:{txt:(}0.00738{txt:)}}    {ralign 12:{txt:(}0.00692{txt:)}}    {ralign 12:{txt:(}0.00919{txt:)}}    {ralign 12:{txt:(}0.00800{txt:)}}   {txt}

{txt}X3          {res}       0.0450*         0.0450*         0.0513*         0.0513*  {txt}
            {res} {ralign 12:{txt:(}0.01914{txt:)}}    {ralign 12:{txt:(}0.01955{txt:)}}    {ralign 12:{txt:(}0.02147{txt:)}}    {ralign 12:{txt:(}0.02184{txt:)}}   {txt}
{txt}{hline 76}
{txt}N           {res}        10000           10000           10000           10000   {txt}
{txt}{hline 76}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. 
. clear
{txt}
{com}. 
. ******************************************
. ************* PROBLEM SET 3 **************
. ******************************************
. 
. ************* Exercise 1: Data Description **************
. import delimited "/Users/ainestorov/Documents/ECON 613/margarine data.csv"
{res}{text}(40 vars, 4,470 obs)

{com}. global product "ppk_stk pbb_stk pfl_stk phse_stk pgen_stk pimp_stk pss_tub ppk_tub pfl_tub phse_tub"
{txt}
{com}. 
. * average and dispersion in price
. tabstat $product , s(mean var) c(s)

{txt}{ralign 12:variable} {...}
{c |}      mean  variance
{hline 13}{c +}{hline 20}
{ralign 12:ppk_stk} {...}
{c |}{...}
 {res} .5184362  .0226555
{txt}{ralign 12:pbb_stk} {...}
{c |}{...}
 {res} .5432103  .0144798
{txt}{ralign 12:pfl_stk} {...}
{c |}{...}
 {res}  1.01502    .00184
{txt}{ralign 12:phse_stk} {...}
{c |}{...}
 {res} .4371476  .0141209
{txt}{ralign 12:pgen_stk} {...}
{c |}{...}
 {res} .3452819  .0012367
{txt}{ralign 12:pimp_stk} {...}
{c |}{...}
 {res} .7807785  .0131437
{txt}{ralign 12:pss_tub} {...}
{c |}{...}
 {res} .8250895  .0037469
{txt}{ralign 12:ppk_tub} {...}
{c |}{...}
 {res} 1.077409  .0008836
{txt}{ralign 12:pfl_tub} {...}
{c |}{...}
 {res} 1.189376  .0001975
{txt}{ralign 12:phse_tub} {...}
{c |}{...}
 {res} .5686734  .0052497
{txt}{hline 13}{c BT}{hline 20}

{com}. 
. * market share by product choice
. tab choice

     {txt}choice {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,766       39.51       39.51
{txt}          2 {c |}{res}        699       15.64       55.15
{txt}          3 {c |}{res}        243        5.44       60.58
{txt}          4 {c |}{res}        593       13.27       73.85
{txt}          5 {c |}{res}        315        7.05       80.89
{txt}          6 {c |}{res}         74        1.66       82.55
{txt}          7 {c |}{res}        319        7.14       89.69
{txt}          8 {c |}{res}        203        4.54       94.23
{txt}          9 {c |}{res}        225        5.03       99.26
{txt}         10 {c |}{res}         33        0.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * market share by brand choice
. gen brand = choice
{txt}
{com}. replace brand = 1 if choice == 8
{txt}(203 real changes made)

{com}. replace brand = 3 if choice == 9
{txt}(225 real changes made)

{com}. replace brand = 4 if choice == 10
{txt}(33 real changes made)

{com}. tab brand

      {txt}brand {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,969       44.05       44.05
{txt}          2 {c |}{res}        699       15.64       59.69
{txt}          3 {c |}{res}        468       10.47       70.16
{txt}          4 {c |}{res}        626       14.00       84.16
{txt}          5 {c |}{res}        315        7.05       91.21
{txt}          6 {c |}{res}         74        1.66       92.86
{txt}          7 {c |}{res}        319        7.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * market share by brand type
. gen type = 1
{txt}
{com}. replace type = 2 if choice > 6
{txt}(780 real changes made)

{com}. tab type

       {txt}type {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,690       82.55       82.55
{txt}          2 {c |}{res}        780       17.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * mapping between choice and income
. tab income choice, row nofreq

           {txt}{c |}                                                    choice
    Income {c |}         1          2          3          4          5          6          7          8          9         10 {c |}     Total
{hline 11}{c +}{hline 110}{c +}{hline 10}
       2.5 {c |}{res}     38.00       8.00       0.00       4.00      12.00       0.00      32.00       2.00       4.00       0.00 {txt}{c |}{res}    100.00 
{txt}       7.5 {c |}{res}     39.66      18.31       4.41      11.53       6.44       0.68       9.15       2.03       7.46       0.34 {txt}{c |}{res}    100.00 
{txt}      12.5 {c |}{res}     39.60      21.41       8.28       8.89       4.65       1.82       8.08       1.62       5.05       0.61 {txt}{c |}{res}    100.00 
{txt}      17.5 {c |}{res}     46.97      14.77       3.99      16.40       3.10       0.74       7.98       2.81       2.95       0.30 {txt}{c |}{res}    100.00 
{txt}      22.5 {c |}{res}     34.64      14.59       4.03      18.27      14.59       0.24       4.86       4.27       3.56       0.95 {txt}{c |}{res}    100.00 
{txt}      27.5 {c |}{res}     40.97      19.75       1.89      14.08       3.78       1.26       5.04       5.25       7.14       0.84 {txt}{c |}{res}    100.00 
{txt}      32.5 {c |}{res}     38.07      15.30       5.10      11.66       9.84       0.73       8.93       3.46       6.01       0.91 {txt}{c |}{res}    100.00 
{txt}      37.5 {c |}{res}     47.31      12.19       6.09      10.39       8.24       0.36       5.38       5.02       3.23       1.79 {txt}{c |}{res}    100.00 
{txt}      42.5 {c |}{res}     41.25      10.89      10.89       7.59       1.98       6.60       8.91       6.93       4.62       0.33 {txt}{c |}{res}    100.00 
{txt}      47.5 {c |}{res}     44.15      11.70      12.23       8.51       3.72       9.04       3.19       4.79       1.06       1.60 {txt}{c |}{res}    100.00 
{txt}        55 {c |}{res}     23.38      14.93       5.47      15.92       3.48       1.49       5.97      20.90       8.46       0.00 {txt}{c |}{res}    100.00 
{txt}      67.5 {c |}{res}     37.25       7.84       1.96      15.69      11.76       3.92      13.73       5.88       0.00       1.96 {txt}{c |}{res}    100.00 
{txt}      87.5 {c |}{res}     24.32      27.03       8.11       2.70       0.00       2.70       2.70       0.00      32.43       0.00 {txt}{c |}{res}    100.00 
{txt}       130 {c |}{res}     19.23       3.85      11.54      30.77       7.69       7.69       0.00       0.00      19.23       0.00 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 110}{c +}{hline 10}
     Total {c |}{res}     39.51      15.64       5.44      13.27       7.05       1.66       7.14       4.54       5.03       0.74 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. * mapping between choice and family size
. tab fam_size choice, row nofreq

           {txt}{c |}                                                    choice
  Fam_Size {c |}         1          2          3          4          5          6          7          8          9         10 {c |}     Total
{hline 11}{c +}{hline 110}{c +}{hline 10}
         1 {c |}{res}     42.05      13.92      10.80       6.53       2.84       1.99       7.10       5.11       9.66       0.00 {txt}{c |}{res}    100.00 
{txt}         2 {c |}{res}     35.69      15.96       9.26      11.60       4.14       1.96       8.81       3.92       8.43       0.23 {txt}{c |}{res}    100.00 
{txt}         3 {c |}{res}     41.75      17.22       3.03      12.42       6.26       1.15       8.04       4.80       5.01       0.31 {txt}{c |}{res}    100.00 
{txt}         4 {c |}{res}     40.88      15.88       2.69      14.58      10.34       0.57       6.51       6.19       1.63       0.73 {txt}{c |}{res}    100.00 
{txt}         5 {c |}{res}     40.51      13.42       5.06      18.23       8.35       5.82       2.03       0.51       2.78       3.29 {txt}{c |}{res}    100.00 
{txt}         6 {c |}{res}     41.99      12.15       0.00      18.23      13.26       0.00       6.63       4.97       0.00       2.76 {txt}{c |}{res}    100.00 
{txt}         7 {c |}{res}      8.33       8.33       0.00      66.67      16.67       0.00       0.00       0.00       0.00       0.00 {txt}{c |}{res}    100.00 
{txt}         8 {c |}{res}     31.25      12.50       0.00      31.25      25.00       0.00       0.00       0.00       0.00       0.00 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 110}{c +}{hline 10}
     Total {c |}{res}     39.51      15.64       5.44      13.27       7.05       1.66       7.14       4.54       5.03       0.74 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. ************* Exercise 2: First Model **************
. * conditional logit
. reshape long sel p, i(id)
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    4470   {txt}->{res}   44700
{txt}Number of variables            {res}      42   {txt}->{res}      25
{txt}j variable (10 values)                    ->   {res}_j
{txt}xij variables:
                    {res}sel1 sel2 ... sel10   {txt}->   {res}sel
                          p1 p2 ... p10   {txt}->   {res}p
{txt}{hline 77}

{com}. asclogit sel p, case(id) alternatives(_j)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7559.2014}  
Iteration 1:{space 3}log likelihood = {res:-7465.2594}  
Iteration 2:{space 3}log likelihood = {res:-7464.9321}  
Iteration 3:{space 3}log likelihood = {res:-7464.9321}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: _j{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}1{txt}){col 67}= {res}   1458.85
{txt}Log likelihood = {res}-7464.9321{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         sel{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}_j           {txt}{c |}
{space 11}p {c |}{col 14}{res}{space 2}-6.656579{col 26}{space 2} .1742793{col 37}{space 1}  -38.19{col 46}{space 3}0.000{col 54}{space 4} -6.99816{col 67}{space 3}-6.314998
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.9543068{col 26}{space 2} .0500462{col 37}{space 1}  -19.07{col 46}{space 3}0.000{col 54}{space 4}-1.052396{col 67}{space 3} -.856218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.296968{col 26}{space 2} .1086515{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 54}{space 4} 1.084015{col 67}{space 3} 1.509921
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.717332{col 26}{space 2} .0541582{col 37}{space 1}  -31.71{col 46}{space 3}0.000{col 54}{space 4} -1.82348{col 67}{space 3}-1.611184
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.904005{col 26}{space 2} .0714605{col 37}{space 1}  -40.64{col 46}{space 3}0.000{col 54}{space 4}-3.044065{col 67}{space 3}-2.763945
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.515311{col 26}{space 2} .1262303{col 37}{space 1}  -12.00{col 46}{space 3}0.000{col 54}{space 4}-1.762718{col 67}{space 3}-1.267904
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2517684{col 26}{space 2}  .079164{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0966098{col 67}{space 3}  .406927
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.464868{col 26}{space 2} .1180467{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} 1.233501{col 67}{space 3} 1.696236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.357505{col 26}{space 2}  .133774{col 37}{space 1}   17.62{col 46}{space 3}0.000{col 54}{space 4} 2.095313{col 67}{space 3} 2.619697
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-3.896594{col 26}{space 2}  .177419{col 37}{space 1}  -21.96{col 46}{space 3}0.000{col 54}{space 4}-4.244328{col 67}{space 3}-3.548859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo PS3_clogit
{txt}
{com}. esttab PS3_clogit, noomitted nostar unstack compress se(3) ///
> nonumbers title(Conditional Logit Regression)
{res}
{txt}Conditional Logit Regression
{txt}{hline 110}
{txt}                 sel                                                                                          
{txt}                  _j         2         3         4         5         6         7         8         9        10
{txt}{hline 110}
{txt}p         {res}    -6.657                                                                                          {txt}
          {res} {ralign 9:{txt:(}0.174{txt:)}}                                                                                          {txt}

{txt}_cons     {res}              -0.954     1.297    -1.717    -2.904    -1.515     0.252     1.465     2.358    -3.897{txt}
          {res}           {ralign 9:{txt:(}0.050{txt:)}} {ralign 9:{txt:(}0.109{txt:)}} {ralign 9:{txt:(}0.054{txt:)}} {ralign 9:{txt:(}0.071{txt:)}} {ralign 9:{txt:(}0.126{txt:)}} {ralign 9:{txt:(}0.079{txt:)}} {ralign 9:{txt:(}0.118{txt:)}} {ralign 9:{txt:(}0.134{txt:)}} {ralign 9:{txt:(}0.177{txt:)}}{txt}
{txt}{hline 110}
{txt}N         {res}     44700                                                                                          {txt}
{txt}{hline 110}
{txt}Standard errors in parentheses

{com}. 
. ************* Exercise 3: Second Model **************
. * multinomial logit
. global demos "income fs3_4 fs5 college whtcollar retired"
{txt}
{com}. mlogit choice $demos

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-82858.567}  
Iteration 1:{space 3}log likelihood = {res:-80447.651}  
Iteration 2:{space 3}log likelihood = {res:-79403.061}  
Iteration 3:{space 3}log likelihood = {res:-79331.196}  
Iteration 4:{space 3}log likelihood = {res:-79328.245}  
Iteration 5:{space 3}log likelihood = {res:-79328.232}  
Iteration 6:{space 3}log likelihood = {res:-79328.232}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}    44,700
{txt}{col 49}LR chi2({res}54{txt}){col 67}= {res}   7060.67
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-79328.232{txt}{col 49}Pseudo R2{col 67}= {res}    0.0426

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0022888{col 26}{space 2} .0010822{col 37}{space 1}   -2.11{col 46}{space 3}0.034{col 54}{space 4}-.0044099{col 67}{space 3}-.0001677
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .0787649{col 26}{space 2} .0364435{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0073369{col 67}{space 3} .1501929
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-.1311055{col 26}{space 2}    .0519{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.2328277{col 67}{space 3}-.0293833
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0447062{col 26}{space 2} .0324443{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-.0188835{col 67}{space 3} .1082959
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.0232783{col 26}{space 2} .0328107{col 37}{space 1}   -0.71{col 46}{space 3}0.478{col 54}{space 4}-.0875861{col 67}{space 3} .0410296
{txt}{space 5}retired {c |}{col 14}{res}{space 2} .2372414{col 26}{space 2} .0426303{col 37}{space 1}    5.57{col 46}{space 3}0.000{col 54}{space 4} .1536876{col 67}{space 3} .3207953
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.943797{col 26}{space 2}  .042156{col 37}{space 1}  -22.39{col 46}{space 3}0.000{col 54}{space 4}-1.026421{col 67}{space 3}-.8611728
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0215169{col 26}{space 2} .0013064{col 37}{space 1}   16.47{col 46}{space 3}0.000{col 54}{space 4} .0189564{col 67}{space 3} .0240774
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} -.889509{col 26}{space 2} .0591852{col 37}{space 1}  -15.03{col 46}{space 3}0.000{col 54}{space 4} -1.00551{col 67}{space 3}-.7735081
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-.8769693{col 26}{space 2} .0889929{col 37}{space 1}   -9.85{col 46}{space 3}0.000{col 54}{space 4}-1.051392{col 67}{space 3}-.7025464
{txt}{space 5}college {c |}{col 14}{res}{space 2} .5656322{col 26}{space 2} .0487204{col 37}{space 1}   11.61{col 46}{space 3}0.000{col 54}{space 4}  .470142{col 67}{space 3} .6611224
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .6285805{col 26}{space 2} .0580108{col 37}{space 1}   10.84{col 46}{space 3}0.000{col 54}{space 4} .5148814{col 67}{space 3} .7422797
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.655095{col 26}{space 2} .0625471{col 37}{space 1}   26.46{col 46}{space 3}0.000{col 54}{space 4} 1.532505{col 67}{space 3} 1.777685
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.323105{col 26}{space 2} .0721417{col 37}{space 1}  -46.06{col 46}{space 3}0.000{col 54}{space 4}  -3.4645{col 67}{space 3} -3.18171
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0037843{col 26}{space 2}  .001071{col 37}{space 1}    3.53{col 46}{space 3}0.000{col 54}{space 4} .0016852{col 67}{space 3} .0058834
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .0389746{col 26}{space 2} .0394585{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4}-.0383627{col 67}{space 3}  .116312
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} .4541159{col 26}{space 2} .0492317{col 37}{space 1}    9.22{col 46}{space 3}0.000{col 54}{space 4} .3576235{col 67}{space 3} .5506082
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.2216919{col 26}{space 2} .0353705{col 37}{space 1}   -6.27{col 46}{space 3}0.000{col 54}{space 4}-.2910167{col 67}{space 3} -.152367
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .0134183{col 26}{space 2} .0345907{col 37}{space 1}    0.39{col 46}{space 3}0.698{col 54}{space 4}-.0543782{col 67}{space 3} .0812147
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-.2190113{col 26}{space 2} .0493722{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4} -.315779{col 67}{space 3}-.1222436
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.191205{col 26}{space 2} .0447291{col 37}{space 1}  -26.63{col 46}{space 3}0.000{col 54}{space 4}-1.278872{col 67}{space 3}-1.103537
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0082135{col 26}{space 2} .0015477{col 37}{space 1}   -5.31{col 46}{space 3}0.000{col 54}{space 4} -.011247{col 67}{space 3}  -.00518
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}  .718805{col 26}{space 2} .0556938{col 37}{space 1}   12.91{col 46}{space 3}0.000{col 54}{space 4} .6096472{col 67}{space 3} .8279628
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} .9824093{col 26}{space 2} .0674673{col 37}{space 1}   14.56{col 46}{space 3}0.000{col 54}{space 4} .8501758{col 67}{space 3} 1.114643
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.3976092{col 26}{space 2} .0463384{col 37}{space 1}   -8.58{col 46}{space 3}0.000{col 54}{space 4}-.4884307{col 67}{space 3}-.3067876
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .6952009{col 26}{space 2} .0469308{col 37}{space 1}   14.81{col 46}{space 3}0.000{col 54}{space 4} .6032181{col 67}{space 3} .7871836
{txt}{space 5}retired {c |}{col 14}{res}{space 2} .3060661{col 26}{space 2} .0645171{col 37}{space 1}    4.74{col 46}{space 3}0.000{col 54}{space 4}  .179615{col 67}{space 3} .4325173
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.452505{col 26}{space 2} .0654568{col 37}{space 1}  -37.47{col 46}{space 3}0.000{col 54}{space 4}-2.580798{col 67}{space 3}-2.324212
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0308753{col 26}{space 2} .0016019{col 37}{space 1}   19.27{col 46}{space 3}0.000{col 54}{space 4} .0277357{col 67}{space 3} .0340149
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.5662443{col 26}{space 2} .1118401{col 37}{space 1}   -5.06{col 46}{space 3}0.000{col 54}{space 4} -.785447{col 67}{space 3}-.3470417
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} .8549593{col 26}{space 2} .1177947{col 37}{space 1}    7.26{col 46}{space 3}0.000{col 54}{space 4}  .624086{col 67}{space 3} 1.085833
{txt}{space 5}college {c |}{col 14}{res}{space 2} .1110987{col 26}{space 2} .0896781{col 37}{space 1}    1.24{col 46}{space 3}0.215{col 54}{space 4}-.0646672{col 67}{space 3} .2868645
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .0611138{col 26}{space 2} .0994183{col 37}{space 1}    0.61{col 46}{space 3}0.539{col 54}{space 4}-.1337426{col 67}{space 3} .2559701
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.345394{col 26}{space 2} .1128183{col 37}{space 1}   11.93{col 46}{space 3}0.000{col 54}{space 4} 1.124274{col 67}{space 3} 1.566514
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.569767{col 26}{space 2} .1200432{col 37}{space 1}  -38.07{col 46}{space 3}0.000{col 54}{space 4}-4.805047{col 67}{space 3}-4.334486
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0054505{col 26}{space 2} .0014924{col 37}{space 1}   -3.65{col 46}{space 3}0.000{col 54}{space 4}-.0083757{col 67}{space 3}-.0025254
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} -.499242{col 26}{space 2} .0451327{col 37}{space 1}  -11.06{col 46}{space 3}0.000{col 54}{space 4}-.5877004{col 67}{space 3}-.4107836
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-1.275572{col 26}{space 2} .0820668{col 37}{space 1}  -15.54{col 46}{space 3}0.000{col 54}{space 4} -1.43642{col 67}{space 3}-1.114723
{txt}{space 5}college {c |}{col 14}{res}{space 2}   .08527{col 26}{space 2} .0435103{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4}-8.66e-06{col 67}{space 3} .1705487
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.0567072{col 26}{space 2} .0440189{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-.1429826{col 67}{space 3} .0295683
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-.7956551{col 26}{space 2}  .062611{col 37}{space 1}  -12.71{col 46}{space 3}0.000{col 54}{space 4}-.9183704{col 67}{space 3}-.6729398
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.050592{col 26}{space 2} .0524212{col 37}{space 1}  -20.04{col 46}{space 3}0.000{col 54}{space 4}-1.153336{col 67}{space 3}-.9478485
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0289522{col 26}{space 2} .0012955{col 37}{space 1}   22.35{col 46}{space 3}0.000{col 54}{space 4}  .026413{col 67}{space 3} .0314913
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.3025615{col 26}{space 2} .0550384{col 37}{space 1}   -5.50{col 46}{space 3}0.000{col 54}{space 4}-.4104348{col 67}{space 3}-.1946882
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-1.405028{col 26}{space 2} .1101578{col 37}{space 1}  -12.75{col 46}{space 3}0.000{col 54}{space 4}-1.620934{col 67}{space 3}-1.189123
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.4462931{col 26}{space 2}  .056892{col 37}{space 1}   -7.84{col 46}{space 3}0.000{col 54}{space 4}-.5577994{col 67}{space 3}-.3347868
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.3362806{col 26}{space 2} .0531422{col 37}{space 1}   -6.33{col 46}{space 3}0.000{col 54}{space 4}-.4404375{col 67}{space 3}-.2321238
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-1.082124{col 26}{space 2} .0870995{col 37}{space 1}  -12.42{col 46}{space 3}0.000{col 54}{space 4}-1.252836{col 67}{space 3}-.9114122
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.258933{col 26}{space 2} .0641996{col 37}{space 1}  -35.19{col 46}{space 3}0.000{col 54}{space 4}-2.384762{col 67}{space 3}-2.133105
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0271856{col 26}{space 2} .0012638{col 37}{space 1}   21.51{col 46}{space 3}0.000{col 54}{space 4} .0247086{col 67}{space 3} .0296626
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-1.204837{col 26}{space 2} .0552579{col 37}{space 1}  -21.80{col 46}{space 3}0.000{col 54}{space 4} -1.31314{col 67}{space 3}-1.096533
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-1.747421{col 26}{space 2} .1078657{col 37}{space 1}  -16.20{col 46}{space 3}0.000{col 54}{space 4}-1.958834{col 67}{space 3}-1.536008
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.3537253{col 26}{space 2} .0539122{col 37}{space 1}   -6.56{col 46}{space 3}0.000{col 54}{space 4}-.4593912{col 67}{space 3}-.2480594
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .4312768{col 26}{space 2} .0574858{col 37}{space 1}    7.50{col 46}{space 3}0.000{col 54}{space 4} .3186066{col 67}{space 3}  .543947
{txt}{space 5}retired {c |}{col 14}{res}{space 2}  .542517{col 26}{space 2} .0627443{col 37}{space 1}    8.65{col 46}{space 3}0.000{col 54}{space 4} .4195404{col 67}{space 3} .6654935
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.491972{col 26}{space 2} .0654225{col 37}{space 1}  -38.09{col 46}{space 3}0.000{col 54}{space 4}-2.620198{col 67}{space 3}-2.363747
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0032369{col 26}{space 2} .0039748{col 37}{space 1}   -0.81{col 46}{space 3}0.415{col 54}{space 4}-.0110273{col 67}{space 3} .0045536
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .8885887{col 26}{space 2} .2160823{col 37}{space 1}    4.11{col 46}{space 3}0.000{col 54}{space 4} .4650752{col 67}{space 3} 1.312102
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} 2.584383{col 26}{space 2} .2122345{col 37}{space 1}   12.18{col 46}{space 3}0.000{col 54}{space 4} 2.168411{col 67}{space 3} 3.000355
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.1082509{col 26}{space 2} .1262599{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4}-.3557159{col 67}{space 3}  .139214
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} 2.369112{col 26}{space 2} .2417049{col 37}{space 1}    9.80{col 46}{space 3}0.000{col 54}{space 4} 1.895379{col 67}{space 3} 2.842845
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.074672{col 26}{space 2} .1866394{col 37}{space 1}    5.76{col 46}{space 3}0.000{col 54}{space 4} .7088652{col 67}{space 3} 1.440478
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.131792{col 26}{space 2} .2906565{col 37}{space 1}  -24.54{col 46}{space 3}0.000{col 54}{space 4}-7.701468{col 67}{space 3}-6.562116
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo PS3_mlogit
{txt}
{com}. esttab PS3_mlogit, noomitted nostar unstack compress se(4) ///
> nonumbers title(Multinomial Logit Regression)
{res}
{txt}Multinomial Logit Regression
{txt}{hline 100}
{txt}              choice                                                                                
{txt}                   2         3         4         5         6         7         8         9        10
{txt}{hline 100}
{txt}income    {res}  -0.00229    0.0215   0.00378  -0.00821    0.0309  -0.00545    0.0290    0.0272  -0.00324{txt}
          {res} {ralign 9:{txt:(}0.0011{txt:)}} {ralign 9:{txt:(}0.0013{txt:)}} {ralign 9:{txt:(}0.0011{txt:)}} {ralign 9:{txt:(}0.0015{txt:)}} {ralign 9:{txt:(}0.0016{txt:)}} {ralign 9:{txt:(}0.0015{txt:)}} {ralign 9:{txt:(}0.0013{txt:)}} {ralign 9:{txt:(}0.0013{txt:)}} {ralign 9:{txt:(}0.0040{txt:)}}{txt}

{txt}fs3_4     {res}    0.0788    -0.890    0.0390     0.719    -0.566    -0.499    -0.303    -1.205     0.889{txt}
          {res} {ralign 9:{txt:(}0.0364{txt:)}} {ralign 9:{txt:(}0.0592{txt:)}} {ralign 9:{txt:(}0.0395{txt:)}} {ralign 9:{txt:(}0.0557{txt:)}} {ralign 9:{txt:(}0.1118{txt:)}} {ralign 9:{txt:(}0.0451{txt:)}} {ralign 9:{txt:(}0.0550{txt:)}} {ralign 9:{txt:(}0.0553{txt:)}} {ralign 9:{txt:(}0.2161{txt:)}}{txt}

{txt}fs5       {res}    -0.131    -0.877     0.454     0.982     0.855    -1.276    -1.405    -1.747     2.584{txt}
          {res} {ralign 9:{txt:(}0.0519{txt:)}} {ralign 9:{txt:(}0.0890{txt:)}} {ralign 9:{txt:(}0.0492{txt:)}} {ralign 9:{txt:(}0.0675{txt:)}} {ralign 9:{txt:(}0.1178{txt:)}} {ralign 9:{txt:(}0.0821{txt:)}} {ralign 9:{txt:(}0.1102{txt:)}} {ralign 9:{txt:(}0.1079{txt:)}} {ralign 9:{txt:(}0.2122{txt:)}}{txt}

{txt}college   {res}    0.0447     0.566    -0.222    -0.398     0.111    0.0853    -0.446    -0.354    -0.108{txt}
          {res} {ralign 9:{txt:(}0.0324{txt:)}} {ralign 9:{txt:(}0.0487{txt:)}} {ralign 9:{txt:(}0.0354{txt:)}} {ralign 9:{txt:(}0.0463{txt:)}} {ralign 9:{txt:(}0.0897{txt:)}} {ralign 9:{txt:(}0.0435{txt:)}} {ralign 9:{txt:(}0.0569{txt:)}} {ralign 9:{txt:(}0.0539{txt:)}} {ralign 9:{txt:(}0.1263{txt:)}}{txt}

{txt}whtcollar {res}   -0.0233     0.629    0.0134     0.695    0.0611   -0.0567    -0.336     0.431     2.369{txt}
          {res} {ralign 9:{txt:(}0.0328{txt:)}} {ralign 9:{txt:(}0.0580{txt:)}} {ralign 9:{txt:(}0.0346{txt:)}} {ralign 9:{txt:(}0.0469{txt:)}} {ralign 9:{txt:(}0.0994{txt:)}} {ralign 9:{txt:(}0.0440{txt:)}} {ralign 9:{txt:(}0.0531{txt:)}} {ralign 9:{txt:(}0.0575{txt:)}} {ralign 9:{txt:(}0.2417{txt:)}}{txt}

{txt}retired   {res}     0.237     1.655    -0.219     0.306     1.345    -0.796    -1.082     0.543     1.075{txt}
          {res} {ralign 9:{txt:(}0.0426{txt:)}} {ralign 9:{txt:(}0.0625{txt:)}} {ralign 9:{txt:(}0.0494{txt:)}} {ralign 9:{txt:(}0.0645{txt:)}} {ralign 9:{txt:(}0.1128{txt:)}} {ralign 9:{txt:(}0.0626{txt:)}} {ralign 9:{txt:(}0.0871{txt:)}} {ralign 9:{txt:(}0.0627{txt:)}} {ralign 9:{txt:(}0.1866{txt:)}}{txt}

{txt}_cons     {res}    -0.944    -3.323    -1.191    -2.453    -4.570    -1.051    -2.259    -2.492    -7.132{txt}
          {res} {ralign 9:{txt:(}0.0422{txt:)}} {ralign 9:{txt:(}0.0721{txt:)}} {ralign 9:{txt:(}0.0447{txt:)}} {ralign 9:{txt:(}0.0655{txt:)}} {ralign 9:{txt:(}0.1200{txt:)}} {ralign 9:{txt:(}0.0524{txt:)}} {ralign 9:{txt:(}0.0642{txt:)}} {ralign 9:{txt:(}0.0654{txt:)}} {ralign 9:{txt:(}0.2907{txt:)}}{txt}
{txt}{hline 100}
{txt}N         {res}     44700                                                                                {txt}
{txt}{hline 100}
{txt}Standard errors in parentheses

{com}. 
. ************* Exercise 4: Marginal Effects **************
. * conditional logit
. quietly asclogit sel p, case(id) alternatives(_j)
{txt}
{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .41862592
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-1.62007}}}{space 1}{space 1}{ralign 8:{res:{sf: .045076}}}{space 1}{space 1}{ralign 6:{res:{sf:-35.94}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.70841}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.53172}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .13669617
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.785545}}}{space 1}{space 1}{ralign 8:{res:{sf: .030158}}}{space 1}{space 1}{ralign 6:{res:{sf:-26.05}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.844654}}}{space 1}{space 1}{ralign 8:{res:{sf:-.726436}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05617075
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.352903}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02284}}}{space 1}{space 1}{ralign 6:{res:{sf:-15.45}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.397668}}}{space 1}{space 1}{ralign 8:{res:{sf:-.308137}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .12912093
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.748524}}}{space 1}{space 1}{ralign 8:{res:{sf: .031316}}}{space 1}{space 1}{ralign 6:{res:{sf:-23.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.809901}}}{space 1}{space 1}{ralign 8:{res:{sf:-.687146}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07264529
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: -.44844}}}{space 1}{space 1}{ralign 8:{res:{sf: .025561}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.498539}}}{space 1}{space 1}{ralign 8:{res:{sf:-.398341}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01604447
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.105088}}}{space 1}{space 1}{ralign 8:{res:{sf: .012245}}}{space 1}{space 1}{ralign 6:{res:{sf: -8.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.129087}}}{space 1}{space 1}{ralign 8:{res:{sf:-.081089}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .06992927
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.432938}}}{space 1}{space 1}{ralign 8:{res:{sf: .024519}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.66}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.480995}}}{space 1}{space 1}{ralign 8:{res:{sf:-.384882}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04385975
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.279151}}}{space 1}{space 1}{ralign 8:{res:{sf: .019602}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: -.31757}}}{space 1}{space 1}{ralign 8:{res:{sf:-.240731}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .05082152
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.321105}}}{space 1}{space 1}{ralign 8:{res:{sf: .021545}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.363332}}}{space 1}{space 1}{ralign 8:{res:{sf:-.278878}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00608591
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:p}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.040265}}}{space 1}{space 1}{ralign 8:{res:{sf: .007011}}}{space 1}{space 1}{ralign 6:{res:{sf: -5.74}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.054006}}}{space 1}{space 1}{ralign 8:{res:{sf:-.026523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. 
. * multinomial logit
. quietly mlogit choice $demos
{txt}
{com}. mfx

{txt}Marginal effects after mlogit
      y  = Pr(choice==1) (predict)
         = {res}  .4225161
{txt}{hline 9}{c TT}{hline 68}
variable {c |}{col 17}dy/dx{col 26}Std. Err.{col 40}z{col 45}P>|z|{col 52}[    95% C.I.   ]{col 75}X
{hline 9}{c +}{hline 68}
  income {c |}  {res}-.0011512      .00017   -6.62   0.000  -.001492 -.000811   27.6639
   {txt}fs3_4*{c |}  {res} .0294656      .00605    4.87   0.000   .017602  .041329   .489038
     {txt}fs5*{c |}  {res} -.011298      .00862   -1.31   0.190  -.028202  .005606   .135123
 {txt}college*{c |}  {res} .0192106      .00548    3.51   0.000   .008469  .029953   .316331
{txt}whtcol~r*{c |}  {res}-.0314548      .00553   -5.69   0.000  -.042291 -.020618   .581208
 {txt}retired*{c |}  {res} -.049328      .00717   -6.88   0.000  -.063378 -.035278   .216107
{txt}{hline 9}{c BT}{hline 68}
(*) dy/dx is for discrete change of dummy variable from 0 to 1

{com}. 
. ************* Exercise 5: IIA **************
. * mixed logit
. asmixlogit sel p, case(id) alternatives(_j) casevars($demos)
{res}
{txt}Fitting fixed parameter model:
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7110.3752}  
Iteration 1:{space 3}log likelihood = {res:-7110.3752}  
{res}
{txt}Alternative-specific mixed logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: {res}id{txt}{col 48}Number of cases{col 67}= {res}     4,470

{txt}Alternative variable: {res}_j{txt}{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}Integration points:{res}              0{txt}{col 51}Wald chi2({res}55{txt}){col 67}= {res}   2022.56
{txt}Log likelihood =        {res}-7110.3752{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         sel{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}_j           {txt}{c |}
{space 11}p {c |}{col 14}{res}{space 2}-6.727505{col 26}{space 2} .1769229{col 37}{space 1}  -38.03{col 46}{space 3}0.000{col 54}{space 4}-7.074268{col 67}{space 3}-6.380743
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0031802{col 26}{space 2} .0037716{col 37}{space 1}   -0.84{col 46}{space 3}0.399{col 54}{space 4}-.0105723{col 67}{space 3} .0042119
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .0731491{col 26}{space 2} .1279555{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-.1776392{col 67}{space 3} .3239373
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-.2352675{col 26}{space 2} .1818468{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4}-.5916807{col 67}{space 3} .1211457
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0497422{col 26}{space 2}  .113986{col 37}{space 1}    0.44{col 46}{space 3}0.663{col 54}{space 4}-.1736663{col 67}{space 3} .2731507
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.0394665{col 26}{space 2} .1156033{col 37}{space 1}   -0.34{col 46}{space 3}0.733{col 54}{space 4}-.2660449{col 67}{space 3} .1871119
{txt}{space 5}retired {c |}{col 14}{res}{space 2} .2625538{col 26}{space 2} .1520035{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0353677{col 67}{space 3} .5604752
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.929614{col 26}{space 2} .1485089{col 37}{space 1}   -6.26{col 46}{space 3}0.000{col 54}{space 4}-1.220686{col 67}{space 3}-.6385419
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0217094{col 26}{space 2} .0042576{col 37}{space 1}    5.10{col 46}{space 3}0.000{col 54}{space 4} .0133648{col 67}{space 3} .0300541
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.9008915{col 26}{space 2} .1903256{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-1.273923{col 67}{space 3}-.5278601
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-.8852396{col 26}{space 2} .2864282{col 37}{space 1}   -3.09{col 46}{space 3}0.002{col 54}{space 4}-1.446629{col 67}{space 3}-.3238506
{txt}{space 5}college {c |}{col 14}{res}{space 2} .5795113{col 26}{space 2}  .158871{col 37}{space 1}    3.65{col 46}{space 3}0.000{col 54}{space 4} .2681299{col 67}{space 3} .8908927
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .6047619{col 26}{space 2} .1865997{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .2390331{col 67}{space 3} .9704907
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.774491{col 26}{space 2} .2018475{col 37}{space 1}    8.79{col 46}{space 3}0.000{col 54}{space 4} 1.378877{col 67}{space 3} 2.170105
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.018311{col 26}{space 2} .2452193{col 37}{space 1}   -0.07{col 46}{space 3}0.940{col 54}{space 4} -.498932{col 67}{space 3} .4623099
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0038602{col 26}{space 2}  .003531{col 37}{space 1}    1.09{col 46}{space 3}0.274{col 54}{space 4}-.0030604{col 67}{space 3} .0107808
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .0767795{col 26}{space 2} .1320042{col 37}{space 1}    0.58{col 46}{space 3}0.561{col 54}{space 4}-.1819439{col 67}{space 3} .3355028
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} .4187164{col 26}{space 2} .1666443{col 37}{space 1}    2.51{col 46}{space 3}0.012{col 54}{space 4} .0920997{col 67}{space 3} .7453332
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.2531909{col 26}{space 2} .1184884{col 37}{space 1}   -2.14{col 46}{space 3}0.033{col 54}{space 4}-.4854238{col 67}{space 3} -.020958
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .0455049{col 26}{space 2} .1156703{col 37}{space 1}    0.39{col 46}{space 3}0.694{col 54}{space 4}-.1812047{col 67}{space 3} .2722146
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-.1570552{col 26}{space 2} .1644688{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-.4794081{col 67}{space 3} .1652977
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.860976{col 26}{space 2} .1506071{col 37}{space 1}  -12.36{col 46}{space 3}0.000{col 54}{space 4}-2.156161{col 67}{space 3}-1.565791
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0072133{col 26}{space 2} .0049865{col 37}{space 1}   -1.45{col 46}{space 3}0.148{col 54}{space 4}-.0169866{col 67}{space 3}   .00256
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .6627287{col 26}{space 2} .1792775{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .3113514{col 67}{space 3} 1.014106
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} .9184167{col 26}{space 2} .2185429{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4} .4900805{col 67}{space 3} 1.346753
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.3604242{col 26}{space 2} .1498394{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4} -.654104{col 67}{space 3}-.0667444
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .6898882{col 26}{space 2} .1517937{col 37}{space 1}    4.54{col 46}{space 3}0.000{col 54}{space 4} .3923779{col 67}{space 3} .9873984
{txt}{space 5}retired {c |}{col 14}{res}{space 2} .4102554{col 26}{space 2} .2088182{col 37}{space 1}    1.96{col 46}{space 3}0.049{col 54}{space 4} .0009792{col 67}{space 3} .8195316
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.663883{col 26}{space 2} .2136511{col 37}{space 1}  -17.15{col 46}{space 3}0.000{col 54}{space 4}-4.082632{col 67}{space 3}-3.245135
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0303074{col 26}{space 2} .0051936{col 37}{space 1}    5.84{col 46}{space 3}0.000{col 54}{space 4} .0201282{col 67}{space 3} .0404867
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.5696844{col 26}{space 2} .3538738{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-1.263264{col 67}{space 3} .1238954
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} .8469135{col 26}{space 2} .3767975{col 37}{space 1}    2.25{col 46}{space 3}0.025{col 54}{space 4} .1084039{col 67}{space 3} 1.585423
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0944586{col 26}{space 2} .2866385{col 37}{space 1}    0.33{col 46}{space 3}0.742{col 54}{space 4}-.4673424{col 67}{space 3} .6562597
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .1254906{col 26}{space 2}  .315912{col 37}{space 1}    0.40{col 46}{space 3}0.691{col 54}{space 4}-.4936855{col 67}{space 3} .7446667
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.481564{col 26}{space 2} .3555819{col 37}{space 1}    4.17{col 46}{space 3}0.000{col 54}{space 4} .7846365{col 67}{space 3} 2.178492
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.937473{col 26}{space 2} .3794526{col 37}{space 1}   -7.74{col 46}{space 3}0.000{col 54}{space 4}-3.681186{col 67}{space 3}-2.193759
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0073341{col 26}{space 2} .0049069{col 37}{space 1}   -1.49{col 46}{space 3}0.135{col 54}{space 4}-.0169515{col 67}{space 3} .0022832
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.5224593{col 26}{space 2} .1497186{col 37}{space 1}   -3.49{col 46}{space 3}0.000{col 54}{space 4}-.8159024{col 67}{space 3}-.2290162
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-1.371098{col 26}{space 2} .2677438{col 37}{space 1}   -5.12{col 46}{space 3}0.000{col 54}{space 4}-1.895867{col 67}{space 3}-.8463301
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0791834{col 26}{space 2} .1438936{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-.2028428{col 67}{space 3} .3612097
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.0807929{col 26}{space 2}  .145883{col 37}{space 1}   -0.55{col 46}{space 3}0.580{col 54}{space 4}-.3667184{col 67}{space 3} .2051326
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-.7739959{col 26}{space 2}  .207446{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-1.180583{col 67}{space 3}-.3674093
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.017887{col 26}{space 2} .1818105{col 37}{space 1}    5.60{col 46}{space 3}0.000{col 54}{space 4} .6615448{col 67}{space 3} 1.374229
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0289606{col 26}{space 2} .0043108{col 37}{space 1}    6.72{col 46}{space 3}0.000{col 54}{space 4} .0205115{col 67}{space 3} .0374096
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.3329098{col 26}{space 2} .1786041{col 37}{space 1}   -1.86{col 46}{space 3}0.062{col 54}{space 4}-.6829675{col 67}{space 3} .0171479
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-1.430573{col 26}{space 2} .3511689{col 37}{space 1}   -4.07{col 46}{space 3}0.000{col 54}{space 4}-2.118851{col 67}{space 3}-.7422944
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.3869989{col 26}{space 2} .1831041{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-.7458764{col 67}{space 3}-.0281213
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.4358122{col 26}{space 2}  .173086{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-.7750545{col 67}{space 3}-.0965699
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-.8953734{col 26}{space 2} .2790262{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-1.442255{col 67}{space 3}-.3484921
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.42636{col 26}{space 2} .2282158{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .9790651{col 67}{space 3} 1.873655
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .026776{col 26}{space 2} .0041764{col 37}{space 1}    6.41{col 46}{space 3}0.000{col 54}{space 4} .0185904{col 67}{space 3} .0349617
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-1.247258{col 26}{space 2} .1788146{col 37}{space 1}   -6.98{col 46}{space 3}0.000{col 54}{space 4}-1.597728{col 67}{space 3}-.8967878
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-1.752459{col 26}{space 2} .3437858{col 37}{space 1}   -5.10{col 46}{space 3}0.000{col 54}{space 4}-2.426267{col 67}{space 3}-1.078651
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.3315221{col 26}{space 2} .1742426{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-.6730313{col 67}{space 3} .0099871
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}  .365318{col 26}{space 2} .1855402{col 37}{space 1}    1.97{col 46}{space 3}0.049{col 54}{space 4} .0016658{col 67}{space 3} .7289702
{txt}{space 5}retired {c |}{col 14}{res}{space 2} .6922821{col 26}{space 2}  .203554{col 37}{space 1}    3.40{col 46}{space 3}0.001{col 54}{space 4} .2933236{col 67}{space 3} 1.091241
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.010108{col 26}{space 2} .2406306{col 37}{space 1}    8.35{col 46}{space 3}0.000{col 54}{space 4} 1.538481{col 67}{space 3} 2.481736
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0026379{col 26}{space 2} .0127081{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.0275453{col 67}{space 3} .0222696
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}  .700144{col 26}{space 2} .6743085{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4}-.6214765{col 67}{space 3} 2.021764
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} 2.477214{col 26}{space 2} .6664281{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} 1.171039{col 67}{space 3} 3.783389
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0426424{col 26}{space 2} .4003562{col 37}{space 1}    0.11{col 46}{space 3}0.915{col 54}{space 4}-.7420414{col 67}{space 3} .8273262
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} 2.171549{col 26}{space 2} .7630716{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .6759567{col 67}{space 3} 3.667142
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.043842{col 26}{space 2} .5954876{col 37}{space 1}    1.75{col 46}{space 3}0.080{col 54}{space 4}-.1232923{col 67}{space 3} 2.210976
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.883823{col 26}{space 2} .9243188{col 37}{space 1}   -7.45{col 46}{space 3}0.000{col 54}{space 4}-8.695454{col 67}{space 3}-5.072191
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo PS3_mxdlogit1
{txt}
{com}. esttab PS3_mxdlogit1, noomitted nostar unstack compress se(3) ///
> nonumbers title(Mixed Logit Regression)
{res}
{txt}Mixed Logit Regression
{txt}{hline 110}
{txt}                 sel                                                                                          
{txt}                  _j         2         3         4         5         6         7         8         9        10
{txt}{hline 110}
{txt}p         {res}    -6.728                                                                                          {txt}
          {res} {ralign 9:{txt:(}0.177{txt:)}}                                                                                          {txt}

{txt}income    {res}            -0.00318    0.0217   0.00386  -0.00721    0.0303  -0.00733    0.0290    0.0268  -0.00264{txt}
          {res}           {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.005{txt:)}} {ralign 9:{txt:(}0.005{txt:)}} {ralign 9:{txt:(}0.005{txt:)}} {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.013{txt:)}}{txt}

{txt}fs3_4     {res}              0.0731    -0.901    0.0768     0.663    -0.570    -0.522    -0.333    -1.247     0.700{txt}
          {res}           {ralign 9:{txt:(}0.128{txt:)}} {ralign 9:{txt:(}0.190{txt:)}} {ralign 9:{txt:(}0.132{txt:)}} {ralign 9:{txt:(}0.179{txt:)}} {ralign 9:{txt:(}0.354{txt:)}} {ralign 9:{txt:(}0.150{txt:)}} {ralign 9:{txt:(}0.179{txt:)}} {ralign 9:{txt:(}0.179{txt:)}} {ralign 9:{txt:(}0.674{txt:)}}{txt}

{txt}fs5       {res}              -0.235    -0.885     0.419     0.918     0.847    -1.371    -1.431    -1.752     2.477{txt}
          {res}           {ralign 9:{txt:(}0.182{txt:)}} {ralign 9:{txt:(}0.286{txt:)}} {ralign 9:{txt:(}0.167{txt:)}} {ralign 9:{txt:(}0.219{txt:)}} {ralign 9:{txt:(}0.377{txt:)}} {ralign 9:{txt:(}0.268{txt:)}} {ralign 9:{txt:(}0.351{txt:)}} {ralign 9:{txt:(}0.344{txt:)}} {ralign 9:{txt:(}0.666{txt:)}}{txt}

{txt}college   {res}              0.0497     0.580    -0.253    -0.360    0.0945    0.0792    -0.387    -0.332    0.0426{txt}
          {res}           {ralign 9:{txt:(}0.114{txt:)}} {ralign 9:{txt:(}0.159{txt:)}} {ralign 9:{txt:(}0.118{txt:)}} {ralign 9:{txt:(}0.150{txt:)}} {ralign 9:{txt:(}0.287{txt:)}} {ralign 9:{txt:(}0.144{txt:)}} {ralign 9:{txt:(}0.183{txt:)}} {ralign 9:{txt:(}0.174{txt:)}} {ralign 9:{txt:(}0.400{txt:)}}{txt}

{txt}whtcollar {res}             -0.0395     0.605    0.0455     0.690     0.125   -0.0808    -0.436     0.365     2.172{txt}
          {res}           {ralign 9:{txt:(}0.116{txt:)}} {ralign 9:{txt:(}0.187{txt:)}} {ralign 9:{txt:(}0.116{txt:)}} {ralign 9:{txt:(}0.152{txt:)}} {ralign 9:{txt:(}0.316{txt:)}} {ralign 9:{txt:(}0.146{txt:)}} {ralign 9:{txt:(}0.173{txt:)}} {ralign 9:{txt:(}0.186{txt:)}} {ralign 9:{txt:(}0.763{txt:)}}{txt}

{txt}retired   {res}               0.263     1.774    -0.157     0.410     1.482    -0.774    -0.895     0.692     1.044{txt}
          {res}           {ralign 9:{txt:(}0.152{txt:)}} {ralign 9:{txt:(}0.202{txt:)}} {ralign 9:{txt:(}0.164{txt:)}} {ralign 9:{txt:(}0.209{txt:)}} {ralign 9:{txt:(}0.356{txt:)}} {ralign 9:{txt:(}0.207{txt:)}} {ralign 9:{txt:(}0.279{txt:)}} {ralign 9:{txt:(}0.204{txt:)}} {ralign 9:{txt:(}0.595{txt:)}}{txt}

{txt}_cons     {res}              -0.930   -0.0183    -1.861    -3.664    -2.937     1.018     1.426     2.010    -6.884{txt}
          {res}           {ralign 9:{txt:(}0.149{txt:)}} {ralign 9:{txt:(}0.245{txt:)}} {ralign 9:{txt:(}0.151{txt:)}} {ralign 9:{txt:(}0.214{txt:)}} {ralign 9:{txt:(}0.379{txt:)}} {ralign 9:{txt:(}0.182{txt:)}} {ralign 9:{txt:(}0.228{txt:)}} {ralign 9:{txt:(}0.241{txt:)}} {ralign 9:{txt:(}0.924{txt:)}}{txt}
{txt}{hline 110}
{txt}N         {res}     44700                                                                                          {txt}
{txt}{hline 110}
{txt}Standard errors in parentheses

{com}. 
. * remove one choice (5)
. drop if choice == 5
{txt}(3,150 observations deleted)

{com}. drop if _j == 5
{txt}(4,155 observations deleted)

{com}. drop pgen_stk
{txt}
{com}. 
. * mixed logit using removed data
. asmixlogit sel p, case(id) alternatives(_j) casevars($demos)
{res}
{txt}Fitting fixed parameter model:
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-6077.3108}  
Iteration 1:{space 3}log likelihood = {res:-6077.3108}  
{res}
{txt}Alternative-specific mixed logit{col 48}Number of obs{col 67}= {res}    37,395
{txt}Case variable: {res}id{txt}{col 48}Number of cases{col 67}= {res}     4,155

{txt}Alternative variable: {res}_j{txt}{col 48}Alts per case: min = {res}         9
{col 63}{txt}avg = {res}       9.0
{col 63}{txt}max = {res}         9

{txt}Integration points:{res}              0{txt}{col 51}Wald chi2({res}49{txt}){col 67}= {res}   1809.33
{txt}Log likelihood =        {res}-6077.3108{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         sel{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}_j           {txt}{c |}
{space 11}p {c |}{col 14}{res}{space 2}-6.610583{col 26}{space 2} .1824186{col 37}{space 1}  -36.24{col 46}{space 3}0.000{col 54}{space 4}-6.968117{col 67}{space 3}-6.253049
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0033933{col 26}{space 2} .0037758{col 37}{space 1}   -0.90{col 46}{space 3}0.369{col 54}{space 4}-.0107937{col 67}{space 3} .0040072
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .0699856{col 26}{space 2} .1302196{col 37}{space 1}    0.54{col 46}{space 3}0.591{col 54}{space 4}-.1852402{col 67}{space 3} .3252114
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} -.227525{col 26}{space 2} .1836782{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.5875277{col 67}{space 3} .1324777
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0612247{col 26}{space 2} .1144881{col 37}{space 1}    0.53{col 46}{space 3}0.593{col 54}{space 4}-.1631679{col 67}{space 3} .2856173
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.0338243{col 26}{space 2} .1171033{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-.2633426{col 67}{space 3}  .195694
{txt}{space 5}retired {c |}{col 14}{res}{space 2} .2739727{col 26}{space 2} .1560985{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-.0319747{col 67}{space 3} .5799201
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.9323652{col 26}{space 2} .1513304{col 37}{space 1}   -6.16{col 46}{space 3}0.000{col 54}{space 4}-1.228967{col 67}{space 3}-.6357631
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0216401{col 26}{space 2} .0043024{col 37}{space 1}    5.03{col 46}{space 3}0.000{col 54}{space 4} .0132076{col 67}{space 3} .0300725
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.8477003{col 26}{space 2} .1944139{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-1.228745{col 67}{space 3}-.4666562
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-.8451453{col 26}{space 2} .2870235{col 37}{space 1}   -2.94{col 46}{space 3}0.003{col 54}{space 4}-1.407701{col 67}{space 3}-.2825896
{txt}{space 5}college {c |}{col 14}{res}{space 2} .5648609{col 26}{space 2} .1591605{col 37}{space 1}    3.55{col 46}{space 3}0.000{col 54}{space 4} .2529119{col 67}{space 3} .8768098
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .6268049{col 26}{space 2} .1900914{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} .2542326{col 67}{space 3} .9993773
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.796837{col 26}{space 2} .2087937{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4} 1.387609{col 67}{space 3} 2.206065
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1054403{col 26}{space 2} .2517746{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-.5989095{col 67}{space 3} .3880289
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0038994{col 26}{space 2} .0035428{col 37}{space 1}    1.10{col 46}{space 3}0.271{col 54}{space 4}-.0030443{col 67}{space 3} .0108431
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .0810659{col 26}{space 2} .1340997{col 37}{space 1}    0.60{col 46}{space 3}0.545{col 54}{space 4}-.1817647{col 67}{space 3} .3438965
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} .4356115{col 26}{space 2} .1681748{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4} .1059949{col 67}{space 3}  .765228
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.2419364{col 26}{space 2} .1188671{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4}-.4749115{col 67}{space 3}-.0089612
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .0247957{col 26}{space 2}  .116674{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-.2038812{col 67}{space 3} .2534726
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-.1338254{col 26}{space 2} .1681493{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-.4633921{col 67}{space 3} .1957412
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.858496{col 26}{space 2} .1532876{col 37}{space 1}  -12.12{col 46}{space 3}0.000{col 54}{space 4}-2.158935{col 67}{space 3}-1.558058
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0308816{col 26}{space 2} .0052599{col 37}{space 1}    5.87{col 46}{space 3}0.000{col 54}{space 4} .0205723{col 67}{space 3} .0411908
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.5363653{col 26}{space 2} .3616086{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-1.245105{col 67}{space 3} .1723745
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} .8690284{col 26}{space 2} .3797078{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .1248147{col 67}{space 3} 1.613242
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0862873{col 26}{space 2} .2860027{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.4742677{col 67}{space 3} .6468424
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .1178782{col 26}{space 2} .3192202{col 37}{space 1}    0.37{col 46}{space 3}0.712{col 54}{space 4} -.507782{col 67}{space 3} .7435384
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.490925{col 26}{space 2} .3668309{col 37}{space 1}    4.06{col 46}{space 3}0.000{col 54}{space 4} .7719493{col 67}{space 3}   2.2099
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -2.99025{col 26}{space 2} .3917772{col 37}{space 1}   -7.63{col 46}{space 3}0.000{col 54}{space 4} -3.75812{col 67}{space 3}-2.222381
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0076005{col 26}{space 2} .0048995{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-.0172034{col 67}{space 3} .0020024
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}  -.54964{col 26}{space 2} .1510076{col 37}{space 1}   -3.64{col 46}{space 3}0.000{col 54}{space 4}-.8456095{col 67}{space 3}-.2536705
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-1.382711{col 26}{space 2} .2687433{col 37}{space 1}   -5.15{col 46}{space 3}0.000{col 54}{space 4}-1.909438{col 67}{space 3}-.8559839
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0925473{col 26}{space 2} .1445301{col 37}{space 1}    0.64{col 46}{space 3}0.522{col 54}{space 4}-.1907265{col 67}{space 3} .3758211
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.1116625{col 26}{space 2} .1473551{col 37}{space 1}   -0.76{col 46}{space 3}0.449{col 54}{space 4}-.4004731{col 67}{space 3} .1771482
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-.8239074{col 26}{space 2} .2107011{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-1.236874{col 67}{space 3}-.4109408
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.030977{col 26}{space 2} .1845113{col 37}{space 1}    5.59{col 46}{space 3}0.000{col 54}{space 4} .6693415{col 67}{space 3} 1.392612
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0286105{col 26}{space 2} .0043367{col 37}{space 1}    6.60{col 46}{space 3}0.000{col 54}{space 4} .0201106{col 67}{space 3} .0371103
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-.3535718{col 26}{space 2} .1801434{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-.7066463{col 67}{space 3}-.0004973
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} -1.43559{col 26}{space 2} .3507835{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4}-2.123113{col 67}{space 3}-.7480671
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.3765399{col 26}{space 2} .1836035{col 37}{space 1}   -2.05{col 46}{space 3}0.040{col 54}{space 4}-.7363962{col 67}{space 3}-.0166835
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2}-.4631663{col 26}{space 2} .1742811{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4} -.804751{col 67}{space 3}-.1215816
{txt}{space 5}retired {c |}{col 14}{res}{space 2}-.9475115{col 26}{space 2} .2827955{col 37}{space 1}   -3.35{col 46}{space 3}0.001{col 54}{space 4}-1.501781{col 67}{space 3}-.3932425
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.421988{col 26}{space 2} .2330073{col 37}{space 1}    6.10{col 46}{space 3}0.000{col 54}{space 4} .9653024{col 67}{space 3} 1.878674
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0265049{col 26}{space 2} .0042042{col 37}{space 1}    6.30{col 46}{space 3}0.000{col 54}{space 4} .0182647{col 67}{space 3} .0347451
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2}-1.231738{col 26}{space 2} .1814994{col 37}{space 1}   -6.79{col 46}{space 3}0.000{col 54}{space 4} -1.58747{col 67}{space 3}-.8760058
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2}-1.725627{col 26}{space 2} .3431403{col 37}{space 1}   -5.03{col 46}{space 3}0.000{col 54}{space 4}-2.398169{col 67}{space 3}-1.053084
{txt}{space 5}college {c |}{col 14}{res}{space 2}-.3340856{col 26}{space 2} .1746573{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}-.6764076{col 67}{space 3} .0082365
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} .3734717{col 26}{space 2} .1886164{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 54}{space 4} .0037904{col 67}{space 3}  .743153
{txt}{space 5}retired {c |}{col 14}{res}{space 2} .6760029{col 26}{space 2} .2093603{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4} .2656643{col 67}{space 3} 1.086342
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.942202{col 26}{space 2} .2467482{col 37}{space 1}    7.87{col 46}{space 3}0.000{col 54}{space 4} 1.458584{col 67}{space 3}  2.42582
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0010452{col 26}{space 2} .0130152{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4}-.0265547{col 67}{space 3} .0244642
{txt}{space 7}fs3_4 {c |}{col 14}{res}{space 2} .8306794{col 26}{space 2} .6883148{col 37}{space 1}    1.21{col 46}{space 3}0.227{col 54}{space 4}-.5183928{col 67}{space 3} 2.179752
{txt}{space 9}fs5 {c |}{col 14}{res}{space 2} 2.554763{col 26}{space 2} .6741557{col 37}{space 1}    3.79{col 46}{space 3}0.000{col 54}{space 4} 1.233442{col 67}{space 3} 3.876084
{txt}{space 5}college {c |}{col 14}{res}{space 2} .0653806{col 26}{space 2} .3984551{col 37}{space 1}    0.16{col 46}{space 3}0.870{col 54}{space 4}-.7155771{col 67}{space 3} .8463382
{txt}{space 3}whtcollar {c |}{col 14}{res}{space 2} 2.245586{col 26}{space 2} .7673893{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .7415304{col 67}{space 3} 3.749641
{txt}{space 5}retired {c |}{col 14}{res}{space 2} 1.246079{col 26}{space 2} .6140615{col 37}{space 1}    2.03{col 46}{space 3}0.042{col 54}{space 4} .0425407{col 67}{space 3} 2.449617
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.079153{col 26}{space 2} .9468498{col 37}{space 1}   -7.48{col 46}{space 3}0.000{col 54}{space 4}-8.934945{col 67}{space 3}-5.223362
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo PS3_mxdlogit2
{txt}
{com}. esttab PS3_mxdlogit2, noomitted nostar unstack compress se(3) ///
> nonumbers title(Mixed Logit Regression Without Choice = 5)
{res}
{txt}Mixed Logit Regression Without Choice = 5
{txt}{hline 100}
{txt}                 sel                                                                                
{txt}                  _j         2         3         4         6         7         8         9        10
{txt}{hline 100}
{txt}p         {res}    -6.611                                                                                {txt}
          {res} {ralign 9:{txt:(}0.182{txt:)}}                                                                                {txt}

{txt}income    {res}            -0.00339    0.0216   0.00390    0.0309  -0.00760    0.0286    0.0265  -0.00105{txt}
          {res}           {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.005{txt:)}} {ralign 9:{txt:(}0.005{txt:)}} {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.004{txt:)}} {ralign 9:{txt:(}0.013{txt:)}}{txt}

{txt}fs3_4     {res}              0.0700    -0.848    0.0811    -0.536    -0.550    -0.354    -1.232     0.831{txt}
          {res}           {ralign 9:{txt:(}0.130{txt:)}} {ralign 9:{txt:(}0.194{txt:)}} {ralign 9:{txt:(}0.134{txt:)}} {ralign 9:{txt:(}0.362{txt:)}} {ralign 9:{txt:(}0.151{txt:)}} {ralign 9:{txt:(}0.180{txt:)}} {ralign 9:{txt:(}0.181{txt:)}} {ralign 9:{txt:(}0.688{txt:)}}{txt}

{txt}fs5       {res}              -0.228    -0.845     0.436     0.869    -1.383    -1.436    -1.726     2.555{txt}
          {res}           {ralign 9:{txt:(}0.184{txt:)}} {ralign 9:{txt:(}0.287{txt:)}} {ralign 9:{txt:(}0.168{txt:)}} {ralign 9:{txt:(}0.380{txt:)}} {ralign 9:{txt:(}0.269{txt:)}} {ralign 9:{txt:(}0.351{txt:)}} {ralign 9:{txt:(}0.343{txt:)}} {ralign 9:{txt:(}0.674{txt:)}}{txt}

{txt}college   {res}              0.0612     0.565    -0.242    0.0863    0.0925    -0.377    -0.334    0.0654{txt}
          {res}           {ralign 9:{txt:(}0.114{txt:)}} {ralign 9:{txt:(}0.159{txt:)}} {ralign 9:{txt:(}0.119{txt:)}} {ralign 9:{txt:(}0.286{txt:)}} {ralign 9:{txt:(}0.145{txt:)}} {ralign 9:{txt:(}0.184{txt:)}} {ralign 9:{txt:(}0.175{txt:)}} {ralign 9:{txt:(}0.398{txt:)}}{txt}

{txt}whtcollar {res}             -0.0338     0.627    0.0248     0.118    -0.112    -0.463     0.373     2.246{txt}
          {res}           {ralign 9:{txt:(}0.117{txt:)}} {ralign 9:{txt:(}0.190{txt:)}} {ralign 9:{txt:(}0.117{txt:)}} {ralign 9:{txt:(}0.319{txt:)}} {ralign 9:{txt:(}0.147{txt:)}} {ralign 9:{txt:(}0.174{txt:)}} {ralign 9:{txt:(}0.189{txt:)}} {ralign 9:{txt:(}0.767{txt:)}}{txt}

{txt}retired   {res}               0.274     1.797    -0.134     1.491    -0.824    -0.948     0.676     1.246{txt}
          {res}           {ralign 9:{txt:(}0.156{txt:)}} {ralign 9:{txt:(}0.209{txt:)}} {ralign 9:{txt:(}0.168{txt:)}} {ralign 9:{txt:(}0.367{txt:)}} {ralign 9:{txt:(}0.211{txt:)}} {ralign 9:{txt:(}0.283{txt:)}} {ralign 9:{txt:(}0.209{txt:)}} {ralign 9:{txt:(}0.614{txt:)}}{txt}

{txt}_cons     {res}              -0.932    -0.105    -1.858    -2.990     1.031     1.422     1.942    -7.079{txt}
          {res}           {ralign 9:{txt:(}0.151{txt:)}} {ralign 9:{txt:(}0.252{txt:)}} {ralign 9:{txt:(}0.153{txt:)}} {ralign 9:{txt:(}0.392{txt:)}} {ralign 9:{txt:(}0.185{txt:)}} {ralign 9:{txt:(}0.233{txt:)}} {ralign 9:{txt:(}0.247{txt:)}} {ralign 9:{txt:(}0.947{txt:)}}{txt}
{txt}{hline 100}
{txt}N         {res}     37395                                                                                {txt}
{txt}{hline 100}
{txt}Standard errors in parentheses

{com}. 
. * test statistic and IIA test
. hausman PS3_mxdlogit1 PS3_mxdlogit2, alleqs constant

{txt}{p 0 8}Note: the rank of the differenced variance matrix ({result:54}) does not equal the number of coefficients being tested ({result:57}); be sure this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}PS3_mxdlog~1{col 30}PS3_mxdlog~2{col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{res}_j{col 14}{txt}{c |}
{space 11}p {c |}{res}{col 18}-6.727505{col 31}-6.610583{col 47}-.1169224{col 63}        .
{txt}{hline 13}{c +}{hline 64}
{res}2{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}-.0031802{col 31}-.0033933{col 47}  .000213{col 63}        .
{txt}{space 7}fs3_4 {c |}{res}{col 18} .0731491{col 31} .0699856{col 47} .0031635{col 63}        .
{txt}{space 9}fs5 {c |}{res}{col 18}-.2352675{col 31} -.227525{col 47}-.0077425{col 63}        .
{txt}{space 5}college {c |}{res}{col 18} .0497422{col 31} .0612247{col 47}-.0114825{col 63}        .
{txt}{space 3}whtcollar {c |}{res}{col 18}-.0394665{col 31}-.0338243{col 47}-.0056422{col 63}        .
{txt}{space 5}retired {c |}{res}{col 18} .2625538{col 31} .2739727{col 47}-.0114189{col 63}        .
{txt}{space 7}_cons {c |}{res}{col 18} -.929614{col 31}-.9323652{col 47} .0027511{col 63}        .
{txt}{hline 13}{c +}{hline 64}
{res}3{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18} .0217094{col 31} .0216401{col 47} .0000693{col 63}        .
{txt}{space 7}fs3_4 {c |}{res}{col 18}-.9008915{col 31}-.8477003{col 47}-.0531911{col 63}        .
{txt}{space 9}fs5 {c |}{res}{col 18}-.8852396{col 31}-.8451453{col 47}-.0400944{col 63}        .
{txt}{space 5}college {c |}{res}{col 18} .5795113{col 31} .5648609{col 47} .0146504{col 63}        .
{txt}{space 3}whtcollar {c |}{res}{col 18} .6047619{col 31} .6268049{col 47} -.022043{col 63}        .
{txt}{space 5}retired {c |}{res}{col 18} 1.774491{col 31} 1.796837{col 47}-.0223457{col 63}        .
{txt}{space 7}_cons {c |}{res}{col 18} -.018311{col 31}-.1054403{col 47} .0871292{col 63}        .
{txt}{hline 13}{c +}{hline 64}
{res}4{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18} .0038602{col 31} .0038994{col 47}-.0000392{col 63}        .
{txt}{space 7}fs3_4 {c |}{res}{col 18} .0767795{col 31} .0810659{col 47}-.0042864{col 63}        .
{txt}{space 9}fs5 {c |}{res}{col 18} .4187164{col 31} .4356115{col 47}-.0168951{col 63}        .
{txt}{space 5}college {c |}{res}{col 18}-.2531909{col 31}-.2419364{col 47}-.0112545{col 63}        .
{txt}{space 3}whtcollar {c |}{res}{col 18} .0455049{col 31} .0247957{col 47} .0207093{col 63}        .
{txt}{space 5}retired {c |}{res}{col 18}-.1570552{col 31}-.1338254{col 47}-.0232298{col 63}        .
{txt}{space 7}_cons {c |}{res}{col 18}-1.860976{col 31}-1.858496{col 47}-.0024796{col 63}        .
{txt}{hline 13}{c +}{hline 64}
{res}6{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18} .0303074{col 31} .0308816{col 47}-.0005741{col 63}        .
{txt}{space 7}fs3_4 {c |}{res}{col 18}-.5696844{col 31}-.5363653{col 47}-.0333191{col 63}        .
{txt}{space 9}fs5 {c |}{res}{col 18} .8469135{col 31} .8690284{col 47}-.0221149{col 63}        .
{txt}{space 5}college {c |}{res}{col 18} .0944586{col 31} .0862873{col 47} .0081713{col 63} .0190801
{txt}{space 3}whtcollar {c |}{res}{col 18} .1254906{col 31} .1178782{col 47} .0076124{col 63}        .
{txt}{space 5}retired {c |}{res}{col 18} 1.481564{col 31} 1.490925{col 47}-.0093604{col 63}        .
{txt}{space 7}_cons {c |}{res}{col 18}-2.937473{col 31} -2.99025{col 47} .0527776{col 63}        .
{txt}{hline 13}{c +}{hline 64}
{res}7{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}-.0073341{col 31}-.0076005{col 47} .0002664{col 63} .0002689
{txt}{space 7}fs3_4 {c |}{res}{col 18}-.5224593{col 31}  -.54964{col 47} .0271807{col 63}        .
{txt}{space 9}fs5 {c |}{res}{col 18}-1.371098{col 31}-1.382711{col 47} .0116127{col 63}        .
{txt}{space 5}college {c |}{res}{col 18} .0791834{col 31} .0925473{col 47}-.0133639{col 63}        .
{txt}{space 3}whtcollar {c |}{res}{col 18}-.0807929{col 31}-.1116625{col 47} .0308695{col 63}        .
{txt}{space 5}retired {c |}{res}{col 18}-.7739959{col 31}-.8239074{col 47} .0499114{col 63}        .
{txt}{space 7}_cons {c |}{res}{col 18} 1.017887{col 31} 1.030977{col 47}  -.01309{col 63}        .
{txt}{hline 13}{c +}{hline 64}
{res}8{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18} .0289606{col 31} .0286105{col 47} .0003501{col 63}        .
{txt}{space 7}fs3_4 {c |}{res}{col 18}-.3329098{col 31}-.3535718{col 47}  .020662{col 63}        .
{txt}{space 9}fs5 {c |}{res}{col 18}-1.430573{col 31} -1.43559{col 47} .0050174{col 63} .0164474
{txt}{space 5}college {c |}{res}{col 18}-.3869989{col 31}-.3765399{col 47} -.010459{col 63}        .
{txt}{space 3}whtcollar {c |}{res}{col 18}-.4358122{col 31}-.4631663{col 47} .0273541{col 63}        .
{txt}{space 5}retired {c |}{res}{col 18}-.8953734{col 31}-.9475115{col 47} .0521381{col 63}        .
{txt}{space 7}_cons {c |}{res}{col 18}  1.42636{col 31} 1.421988{col 47} .0043716{col 63}        .
{txt}{hline 13}{c +}{hline 64}
{res}9{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}  .026776{col 31} .0265049{col 47} .0002711{col 63}        .
{txt}{space 7}fs3_4 {c |}{res}{col 18}-1.247258{col 31}-1.231738{col 47}  -.01552{col 63}        .
{txt}{space 9}fs5 {c |}{res}{col 18}-1.752459{col 31}-1.725627{col 47}-.0268325{col 63} .0210582
{txt}{space 5}college {c |}{res}{col 18}-.3315221{col 31}-.3340856{col 47} .0025635{col 63}        .
{txt}{space 3}whtcollar {c |}{res}{col 18}  .365318{col 31} .3734717{col 47}-.0081537{col 63}        .
{txt}{space 5}retired {c |}{res}{col 18} .6922821{col 31} .6760029{col 47} .0162792{col 63}        .
{txt}{space 7}_cons {c |}{res}{col 18} 2.010108{col 31} 1.942202{col 47} .0679065{col 63}        .
{txt}{hline 13}{c +}{hline 64}
{res}10{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}-.0026379{col 31}-.0010452{col 47}-.0015926{col 63}        .
{txt}{space 7}fs3_4 {c |}{res}{col 18}  .700144{col 31} .8306794{col 47}-.1305354{col 63}        .
{txt}{space 9}fs5 {c |}{res}{col 18} 2.477214{col 31} 2.554763{col 47}-.0775485{col 63}        .
{txt}{space 5}college {c |}{res}{col 18} .0426424{col 31} .0653806{col 47}-.0227382{col 63}   .03897
{txt}{space 3}whtcollar {c |}{res}{col 18} 2.171549{col 31} 2.245586{col 47}-.0740364{col 63}        .
{txt}{space 5}retired {c |}{res}{col 18} 1.043842{col 31} 1.246079{col 47}-.2022371{col 63}        .
{txt}{space 7}_cons {c |}{res}{col 18}-6.883823{col 31}-7.079153{col 47} .1953305{col 63}        .
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from asmixlogit}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from asmixlogit}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:54})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}=  {res}      0.96
{txt}{col 17}Prob>chi2 =  {res}    1.0000
{txt}{col 17}(V_b-V_B is not positive definite)

{com}. 
. clear
{txt}
{com}. 
. ******************************************
. ************* PROBLEM SET 4 **************
. ******************************************
. 
. ************* Exercise 1: Data **************
. import delimited "/Users/ainestorov/Documents/ECON 613/Koop-Tobias.csv"
{res}{text}(10 vars, 17,919 obs)

{com}. 
. keep personid logwage timetrnd
{txt}
{com}. reshape wide logwage, i(personid) j(timetrnd)
{txt}(note: j = 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   17919   {txt}->{res}    2178
{txt}Number of variables            {res}       3   {txt}->{res}      16
{txt}j variable (15 values)         {res}timetrnd   {txt}->   (dropped)
xij variables:
                                {res}logwage   {txt}->   {res}logwage0 logwage1 ... logwage14
{txt}{hline 77}

{com}. set seed 15
{txt}
{com}. sample 5, count
{txt}(2,173 observations deleted)

{com}. list, compress
{txt}
     {c TLC}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c TRC}
     {c |} {res}per~d   lo~e0   lo~e1   lo~e2   lo~e3   lo~e4   log~5   log~6   log~7   log~8   log~9   lo~10   lo~11   lo~12   lo~13   lo~14 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c RT}
  1. {c |} {res} 1789       .       .       .       .    1.51    2.11       .    2.32    2.22    2.18    2.13    2.31    2.22    2.01    2.16 {txt}{c |}
  2. {c |} {res}  454       .       .       .    2.51    1.96       .       .       .       .    2.37    2.13       .       .       .       . {txt}{c |}
  3. {c |} {res}  299       .       .       .       .       .       .       .       .    2.52    2.56    2.69    2.61     2.9    2.93    2.22 {txt}{c |}
  4. {c |} {res}  106     2.3       .    2.03     2.7    2.67    3.38    2.91       .    3.77       .       .    3.68    4.06       .    2.91 {txt}{c |}
  5. {c |} {res}  335       .       .       .       .       .       .      .6       .       .    1.78     1.8    2.48    1.87    2.84    2.63 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c BRC}

{com}. clear
{txt}
{com}. 
. ************* Exercise 2: Random Effects **************
. import delimited "/Users/ainestorov/Documents/ECON 613/Koop-Tobias.csv"
{res}{text}(10 vars, 17,919 obs)

{com}. 
. xtset personid timetrnd
{res}{txt}{col 8}panel variable:  {res}personid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}timetrnd, 0 to 14, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtreg logwage educ potexper
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1961                                         {txt}min = {res}         1
{txt}     between = {res}0.1533                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1578                                         {txt}max = {res}        15

                                                {txt}Wald chi2({res}2{txt})      =  {res}  4209.96
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .107938{col 26}{space 2} .0033832{col 37}{space 1}   31.90{col 46}{space 3}0.000{col 54}{space 4} .1013071{col 67}{space 3}  .114569
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0387645{col 26}{space 2} .0007178{col 37}{space 1}   54.00{col 46}{space 3}0.000{col 54}{space 4} .0373576{col 67}{space 3} .0401714
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5635206{col 26}{space 2} .0438846{col 37}{space 1}   12.84{col 46}{space 3}0.000{col 54}{space 4} .4775083{col 67}{space 3} .6495328
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .37207276
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res}  .5516129{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. eststo PS4_REs
{txt}
{com}. esttab PS4_REs, se(3) nonumbers title(Random Effects Model)
{res}
{txt}Random Effects Model
{txt}{hline 28}
{txt}                  logwage   
{txt}{hline 28}
{txt}educ        {res}        0.108***{txt}
            {res} {ralign 12:{txt:(}0.003{txt:)}}   {txt}

{txt}potexper    {res}       0.0388***{txt}
            {res} {ralign 12:{txt:(}0.001{txt:)}}   {txt}

{txt}_cons       {res}        0.564***{txt}
            {res} {ralign 12:{txt:(}0.044{txt:)}}   {txt}
{txt}{hline 28}
{txt}N           {res}        17919   {txt}
{txt}{hline 28}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. clear
{txt}
{com}. 
. ************* Exercise 3: Fixed Effects Model **************
. * between estimator
. import delimited "/Users/ainestorov/Documents/ECON 613/Koop-Tobias.csv"
{res}{text}(10 vars, 17,919 obs)

{com}. 
. xtset personid timetrnd
{res}{txt}{col 8}panel variable:  {res}personid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}timetrnd, 0 to 14, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtreg logwage educ potexper, be

{txt}Between regression (regression on group means)  Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1962                                         {txt}min = {res}         1
{txt}     between = {res}0.1553                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1518                                         {txt}max = {res}        15

                                                {txt}F({res}2{txt},{res}2175{txt})         =  {res}   200.01
{txt}sd(u_i + avg(e_i.))= {res} .3991313                  {txt}Prob > F          =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0930999{col 26}{space 2} .0046685{col 37}{space 1}   19.94{col 46}{space 3}0.000{col 54}{space 4} .0839447{col 67}{space 3} .1022551
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0259987{col 26}{space 2} .0036049{col 37}{space 1}    7.21{col 46}{space 3}0.000{col 54}{space 4} .0189294{col 67}{space 3} .0330681
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8455688{col 26}{space 2} .0770179{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .6945324{col 67}{space 3} .9966052
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo PS4_between
{txt}
{com}. 
. * within estimator - ignore the constant, this is the average of individual FEs
. xtreg logwage educ potexper, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,919
{txt}Group variable: {res}personid{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,178

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1964{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1550{col 63}{txt}avg{col 67}={col 69}{res}       8.2
{txt}     overall = {res}0.1551{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}2{txt},{res}15739{txt}){col 67}={col 70}{res}  1923.47
{txt}corr(u_i, Xb){col 16}= {res}-0.1273{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .123662{col 26}{space 2} .0057619{col 37}{space 1}   21.46{col 46}{space 3}0.000{col 54}{space 4} .1123681{col 67}{space 3} .1349559
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0385611{col 26}{space 2} .0007585{col 37}{space 1}   50.84{col 46}{space 3}0.000{col 54}{space 4} .0370744{col 67}{space 3} .0400478
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4068016{col 26}{space 2} .0717348{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} .2661931{col 67}{space 3}   .54741
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .40290853
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res} .59059603{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}2177{txt}, {res}15739{txt}) = {res}9.95{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. eststo PS4_within
{txt}
{com}. 
. * first time difference estimator
. reg d.(logwage educ potexper), noconstant

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    13,684
{txt}{hline 13}{c +}{hline 34}   F(2, 13682)     = {res}   171.87
{txt}       Model {c |} {res} 38.7282937         2  19.3641469   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1541.54171    13,682  .112669326   {txt}R-squared       ={res}    0.0245
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0244
{txt}       Total {c |} {res} 1580.27001    13,684  .115483046   {txt}Root MSE        =   {res} .33566

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   D.logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0431084{col 26}{space 2} .0151792{col 37}{space 1}    2.84{col 46}{space 3}0.005{col 54}{space 4} .0133551{col 67}{space 3} .0728617
{txt}{space 12} {c |}
{space 4}potexper {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0535369{col 26}{space 2} .0029221{col 37}{space 1}   18.32{col 46}{space 3}0.000{col 54}{space 4} .0478092{col 67}{space 3} .0592647
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo PS4_firstdiff
{txt}
{com}. 
. * results of estimators for comparison
. esttab PS4_between PS4_within PS4_firstdiff, se(3) nonumbers ///
> title(Fixed Effects Model) mtitles("Between Est" "Within Est" "First Diff Est")
{res}
{txt}Fixed Effects Model
{txt}{hline 60}
{txt}              Between Est      Within Est    First Diff~t   
{txt}{hline 60}
{txt}educ        {res}       0.0931***        0.124***                {txt}
            {res} {ralign 12:{txt:(}0.005{txt:)}}    {ralign 12:{txt:(}0.006{txt:)}}                   {txt}

{txt}potexper    {res}       0.0260***       0.0386***                {txt}
            {res} {ralign 12:{txt:(}0.004{txt:)}}    {ralign 12:{txt:(}0.001{txt:)}}                   {txt}

{txt}D.educ      {res}                                       0.0431** {txt}
            {res}                                 {ralign 12:{txt:(}0.015{txt:)}}   {txt}

{txt}D.potexper  {res}                                       0.0535***{txt}
            {res}                                 {ralign 12:{txt:(}0.003{txt:)}}   {txt}

{txt}_cons       {res}        0.846***        0.407***                {txt}
            {res} {ralign 12:{txt:(}0.077{txt:)}}    {ralign 12:{txt:(}0.072{txt:)}}                   {txt}
{txt}{hline 60}
{txt}N           {res}        17919           17919           13684   {txt}
{txt}{hline 60}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. 
. ************* Exercise 4: Understanding Fixed Effects **************
. set seed 15
{txt}
{com}. keep personid educ potexper logwage timetrnd ability mothered fathered ///
> brknhome siblings
{txt}
{com}. reshape wide educ logwage potexper, i(personid) j(timetrnd)
{txt}(note: j = 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   17919   {txt}->{res}    2178
{txt}Number of variables            {res}      10   {txt}->{res}      51
{txt}j variable (15 values)         {res}timetrnd   {txt}->   (dropped)
xij variables:
                                   {res}educ   {txt}->   {res}educ0 educ1 ... educ14
                                logwage   {txt}->   {res}logwage0 logwage1 ... logwage14
                               potexper   {txt}->   {res}potexper0 potexper1 ... potexper14
{txt}{hline 77}

{com}. sample 100, count
{txt}(2,078 observations deleted)

{com}. reshape long
{txt}(note: j = 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     100   {txt}->{res}    1500
{txt}Number of variables            {res}      51   {txt}->{res}      10
{txt}j variable (15 values)                    ->   {res}timetrnd
{txt}xij variables:
                 {res}educ0 educ1 ... educ14   {txt}->   {res}educ
        logwage0 logwage1 ... logwage14   {txt}->   {res}logwage
     potexper0 potexper1 ... potexper14   {txt}->   {res}potexper
{txt}{hline 77}

{com}. 
. * calculate estimated individual fixed effects
. xtreg logwage educ potexper, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       844
{txt}Group variable: {res}personid{txt}{col 49}Number of groups{col 67}={col 69}{res}       100

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.2542{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1055{col 63}{txt}avg{col 67}={col 69}{res}       8.4
{txt}     overall = {res}0.1403{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}2{txt},{res}742{txt}){col 67}={col 70}{res}   126.43
{txt}corr(u_i, Xb){col 16}= {res}-0.3523{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .1849497{col 26}{space 2} .0295433{col 37}{space 1}    6.26{col 46}{space 3}0.000{col 54}{space 4} .1269513{col 67}{space 3} .2429481
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0393434{col 26}{space 2}  .003041{col 37}{space 1}   12.94{col 46}{space 3}0.000{col 54}{space 4} .0333734{col 67}{space 3} .0453134
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.3336139{col 26}{space 2} .3629949{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-1.046233{col 67}{space 3} .3790055
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .45688161
     {txt}sigma_e {c |} {res} .29802249
         {txt}rho {c |} {res} .70151251{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}99{txt}, {res}742{txt}) = {res}13.03{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. predict uhat, u
{txt}(656 missing values generated)

{com}. drop if missing(uhat)
{txt}(656 observations deleted)

{com}. duplicates drop uhat, force

{p 0 4}{txt}Duplicates in terms of {res} uhat{p_end}

{txt}(744 observations deleted)

{com}. 
. * regress estimated individual fixed effects on invariant variables
. global invars "ability mothered fathered brknhome siblings"
{txt}
{com}. reg uhat $invars

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       100
{txt}{hline 13}{c +}{hline 34}   F(5, 94)        = {res}     0.45
{txt}       Model {c |} {res} .480474969         5  .096094994   {txt}Prob > F        ={res}    0.8141
{txt}    Residual {c |} {res} 20.1848648        94  .214732604   {txt}R-squared       ={res}    0.0233
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0287
{txt}       Total {c |} {res} 20.6653398        99  .208740806   {txt}Root MSE        =   {res} .46339

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        uhat{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}ability {c |}{col 14}{res}{space 2}-.0545559{col 26}{space 2} .0597661{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-.1732229{col 67}{space 3} .0641112
{txt}{space 4}mothered {c |}{col 14}{res}{space 2} .0047908{col 26}{space 2} .0197562{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4}-.0344357{col 67}{space 3} .0440172
{txt}{space 4}fathered {c |}{col 14}{res}{space 2}-.0073087{col 26}{space 2} .0166888{col 37}{space 1}   -0.44{col 46}{space 3}0.662{col 54}{space 4}-.0404447{col 67}{space 3} .0258272
{txt}{space 4}brknhome {c |}{col 14}{res}{space 2} -.062316{col 26}{space 2} .1219888{col 37}{space 1}   -0.51{col 46}{space 3}0.611{col 54}{space 4}-.3045277{col 67}{space 3} .1798957
{txt}{space 4}siblings {c |}{col 14}{res}{space 2} .0111786{col 26}{space 2} .0262214{col 37}{space 1}    0.43{col 46}{space 3}0.671{col 54}{space 4}-.0408846{col 67}{space 3} .0632418
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0574255{col 26}{space 2}  .206994{col 37}{space 1}   -0.28{col 46}{space 3}0.782{col 54}{space 4}-.4684169{col 67}{space 3} .3535659
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo PS4_ind_FE
{txt}
{com}. 
. * calculate standard errors of above regression using bootstrap
. bootstrap, reps(99): reg uhat $invars
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}99{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       100
{txt}{col 49}Replications{col 67}= {res}        99
{txt}{col 49}Wald chi2({res}5{txt}){col 67}= {res}      2.63
{txt}{col 49}Prob > chi2{col 67}= {res}    0.7572
{txt}{col 49}R-squared{col 67}= {res}    0.0233
{txt}{col 49}Adj R-squared{col 67}= {res}   -0.0287
{txt}{col 49}Root MSE{col 67}= {res}    0.4634

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}        uhat{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}ability {c |}{col 14}{res}{space 2}-.0545559{col 26}{space 2} .0567501{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4} -.165784{col 67}{space 3} .0566722
{txt}{space 4}mothered {c |}{col 14}{res}{space 2} .0047908{col 26}{space 2} .0210877{col 37}{space 1}    0.23{col 46}{space 3}0.820{col 54}{space 4}-.0365405{col 67}{space 3}  .046122
{txt}{space 4}fathered {c |}{col 14}{res}{space 2}-.0073087{col 26}{space 2}  .018335{col 37}{space 1}   -0.40{col 46}{space 3}0.690{col 54}{space 4}-.0432447{col 67}{space 3} .0286272
{txt}{space 4}brknhome {c |}{col 14}{res}{space 2} -.062316{col 26}{space 2} .1471431{col 37}{space 1}   -0.42{col 46}{space 3}0.672{col 54}{space 4}-.3507112{col 67}{space 3} .2260791
{txt}{space 4}siblings {c |}{col 14}{res}{space 2} .0111786{col 26}{space 2} .0271726{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 54}{space 4}-.0420786{col 67}{space 3} .0644358
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0574255{col 26}{space 2} .1621048{col 37}{space 1}   -0.35{col 46}{space 3}0.723{col 54}{space 4}-.3751451{col 67}{space 3}  .260294
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo PS4_ind_FE_boot
{txt}
{com}. 
. * results of regular and bootstrapped regressions
. esttab PS4_ind_FE PS4_ind_FE_boot, se(4) title(Individual Fixed Effect ///
> Regressions) nonumbers mtitles("Normal Ind FEs" "Bootstrap 99")
{res}
{txt}Individual Fixed Effect Regressions
{txt}{hline 44}
{txt}             Normal Ind~s    Bootstrap 99   
{txt}{hline 44}
{txt}ability     {res}      -0.0546         -0.0546   {txt}
            {res} {ralign 12:{txt:(}0.0598{txt:)}}    {ralign 12:{txt:(}0.0568{txt:)}}   {txt}

{txt}mothered    {res}      0.00479         0.00479   {txt}
            {res} {ralign 12:{txt:(}0.0198{txt:)}}    {ralign 12:{txt:(}0.0211{txt:)}}   {txt}

{txt}fathered    {res}     -0.00731        -0.00731   {txt}
            {res} {ralign 12:{txt:(}0.0167{txt:)}}    {ralign 12:{txt:(}0.0183{txt:)}}   {txt}

{txt}brknhome    {res}      -0.0623         -0.0623   {txt}
            {res} {ralign 12:{txt:(}0.1220{txt:)}}    {ralign 12:{txt:(}0.1471{txt:)}}   {txt}

{txt}siblings    {res}       0.0112          0.0112   {txt}
            {res} {ralign 12:{txt:(}0.0262{txt:)}}    {ralign 12:{txt:(}0.0272{txt:)}}   {txt}

{txt}_cons       {res}      -0.0574         -0.0574   {txt}
            {res} {ralign 12:{txt:(}0.2070{txt:)}}    {ralign 12:{txt:(}0.1621{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          100             100   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/ainestorov/Documents/ECON 613/613 PS5.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Apr 2019, 21:22:47
{txt}{.-}
{smcl}
{txt}{sf}{ul off}